apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/****************************************************************************
 * arch/arm/src/ra8m1/hardware/ra8m1_system.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RA8M1_HARDWARE_RA8M1_SYSTEM_H
#define __ARCH_ARM_SRC_RA8M1_HARDWARE_RA8M1_SYSTEM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/ra8m1_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define R_SYSTEM_SBYCR_OFFSET               0x000c  /* Standby Control Register (8-bits) */
#define R_SYSTEM_SSCR2_OFFSET               0x000e  /* Software Standby Control Register 2 (8-bits) */
#define R_SYSTEM_FLSCR_OFFSET               0x0010  /* Flash Standby Control Register (8-bits) */
#define R_SYSTEM_SCKDIVCR_OFFSET            0x0020  /* System Clock Division Control Register (32-bits) */
#define R_SYSTEM_SCKDIVCR2_OFFSET           0x0024  /* System Clock Division Control Register 2 (8-bits) */
#define R_SYSTEM_SCKSCR_OFFSET              0x0026  /* System Clock Source Control Register (8-bits) */
#define R_SYSTEM_PLLCCR_OFFSET              0x0028  /* PLL Clock Control Register (16-bits) */
#define R_SYSTEM_PLLCR_OFFSET               0x002a  /* PLL Control Register (8-bits) */
#define R_SYSTEM_BCKCR_OFFSET               0x0030  /* External Bus Clock Control Register (8-bits) */
#define R_SYSTEM_MOSCCR_OFFSET              0x0032  /* Main Clock Oscillator Control Register (8-bits) */
#define R_SYSTEM_HOCOCR_OFFSET              0x0036  /* High-Speed On-Chip Oscillator Control Register (8-bits) */
#define R_SYSTEM_MOCOCR_OFFSET              0x0038  /* Middle-Speed On-Chip Oscillator Control Register (8-bits) */
#define R_SYSTEM_FLLCR1_OFFSET              0x0039  /* FLL Control Register 1 (8-bits) */
#define R_SYSTEM_FLLCR2_OFFSET              0x003a  /* FLL Control Register 2 (16-bits) */
#define R_SYSTEM_OSCSF_OFFSET               0x003c  /* Oscillation Stabilization Flag Register (8-bits) */
#define R_SYSTEM_CKOCR_OFFSET               0x003e  /* Clock Out Control Register (8-bits) */
#define R_SYSTEM_TRCKCR_OFFSET              0x003f  /* Trace Clock Control Register (8-bits) */
#define R_SYSTEM_OSTDCR_OFFSET              0x0040  /* Oscillation Stop Detection Control Register (8-bits) */
#define R_SYSTEM_OSTDSR_OFFSET              0x0041  /* Oscillation Stop Detection Status Register (8-bits) */
#define R_SYSTEM_OSCMONR_OFFSET             0x0043  /* Oscillator Monitor Register (8-bits) */
#define R_SYSTEM_PLL2CCR_OFFSET             0x0048  /* PLL2 Clock Control Register (16-bits) */
#define R_SYSTEM_PLL2CR_OFFSET              0x004a  /* PLL2 Control Register (8-bits) */
#define R_SYSTEM_PLLCCR2_OFFSET             0x004c  /* PLL Clock Control Register 2 (16-bits) */
#define R_SYSTEM_PLL2CCR2_OFFSET            0x004e  /* PLL2 Clock Control Register 2 (16-bits) */
#define R_SYSTEM_EBCKOCR_OFFSET             0x0052  /* External Bus Clock Output Control Register (8-bits) */
#define R_SYSTEM_SDCKOCR_OFFSET             0x0053  /* SDRAM Clock Output Control Register (8-bits) */
#define R_SYSTEM_SCICKDIVCR_OFFSET          0x0054  /* SCI clock Division control register (8-bits) */
#define R_SYSTEM_SCICKCR_OFFSET             0x0055  /* SCI clock control register (8-bits) */
#define R_SYSTEM_SPICKDIVCR_OFFSET          0x0056  /* SPI clock Division control register (8-bits) */
#define R_SYSTEM_SPICKCR_OFFSET             0x0057  /* SPI clock control register (8-bits) */
#define R_SYSTEM_ADCCKDIVCR_OFFSET          0x005a  /* ADC clock Division control register (8-bits) */
#define R_SYSTEM_ADCCKCR_OFFSET             0x005b  /* ADC clock control register (8-bits) */
#define R_SYSTEM_GPTCKDIVCR_OFFSET          0x005c  /* GPT clock Division control register (8-bits) */
#define R_SYSTEM_GPTCKCR_OFFSET             0x005d  /* GPT clock control register (8-bits) */
#define R_SYSTEM_LCDCKDIVCR_OFFSET          0x005e  /* LCD clock Division control register (8-bits) */
#define R_SYSTEM_LCDCKCR_OFFSET             0x005f  /* LCD clock control register (8-bits) */
#define R_SYSTEM_MOCOUTCR_OFFSET            0x0061  /* MOCO User Trimming Control Register (8-bits) */
#define R_SYSTEM_HOCOUTCR_OFFSET            0x0062  /* HOCO User Trimming Control Register (8-bits) */
#define R_SYSTEM_USBCKDIVCR_OFFSET          0x006c  /* USB clock Division control register (8-bits) */
#define R_SYSTEM_OCTACKDIVCR_OFFSET         0x006d  /* Octal-SPI clock Division control register (8-bits) */
#define R_SYSTEM_CANFDCKDIVCR_OFFSET        0x006e  /* CANFD Core clock Division control register (8-bits) */
#define R_SYSTEM_USB60CKDIVCR_OFFSET        0x006f  /* USB60 clock Division control register (8-bits) */
#define R_SYSTEM_I3CCKDIVCR_OFFSET          0x0070  /* I3C clock Division control register (8-bits) */
#define R_SYSTEM_USBCKCR_OFFSET             0x0074  /* USB clock control register (8-bits) */
#define R_SYSTEM_OCTACKCR_OFFSET            0x0075  /* Octal-SPI clock control register (8-bits) */
#define R_SYSTEM_CANFDCKCR_OFFSET           0x0076  /* CANFD Core clock control register (8-bits) */
#define R_SYSTEM_USB60CKCR_OFFSET           0x0077  /* USB60 clock control register (8-bits) */
#define R_SYSTEM_I3CCKCR_OFFSET             0x0078  /* I3C clock control register (8-bits) */
#define R_SYSTEM_MOSCSCR_OFFSET             0x007c  /* Main Clock Oscillator Standby Control Register (8-bits) */
#define R_SYSTEM_HOCOSCR_OFFSET             0x007d  /* High-Speed On-Chip Oscillator Standby Control Register (8-bits) */
#define R_SYSTEM_OPCCR_OFFSET               0x00a0  /* Operating Power Control Register (8-bits) */
#define R_SYSTEM_MOSCWTCR_OFFSET            0x00a2  /* Main Clock Oscillator Wait Control Register (8-bits) */
#define R_SYSTEM_RSTSR1_OFFSET              0x00c0  /* Reset Status Register 1 (32-bits) */
#define R_SYSTEM_SYRACCR_OFFSET             0x00cc  /* System Register Access Control Register (8-bits) */
#define R_SYSTEM_PVDCR1_OFFSET              0x00e0  /* Voltage Monitor %s Circuit Control Register 1 (8-bits) */
#define R_SYSTEM_PVDSR_OFFSET               0x00e1  /* Voltage Monitor %s Circuit Status Register (8-bits) */
#define R_SYSTEM_CRVSYSCR_OFFSET            0x00f0  /* Clock Recovery System Control Register (8-bits) */
#define R_SYSTEM_PDCTRGD_OFFSET             0x0110  /* Graphics Power Domain Control Register (8-bits) */
#define R_SYSTEM_PDRAMSCR0_OFFSET           0x0140  /* SRAM power domain Standby Control Register 0 (16-bits) */
#define R_SYSTEM_PDRAMSCR1_OFFSET           0x0142  /* SRAM power domain Standby Control Register 1 (8-bits) */
#define R_SYSTEM_VBRSABAR_OFFSET            0x03b0  /* VBATT Backup Register Security Attribute Boundary Address Register (16-bits) */
#define R_SYSTEM_VBRPABARS_OFFSET           0x03b4  /* VBATT Backup Register Privilege Attribute Boundary Address Register for Secure Region (16-bits) */
#define R_SYSTEM_VBRPABARNS_OFFSET          0x03b8  /* VBATT Backup Register Privilege Attribute Boundary Address Register for Non-secure Region (16-bits) */
#define R_SYSTEM_CGFSAR_OFFSET              0x03c0  /* Clock Generation Function Security Attribute Register (32-bits) */
#define R_SYSTEM_RSTSAR_OFFSET              0x03c4  /* Reset Security Attribution Register (32-bits) */
#define R_SYSTEM_LPMSAR_OFFSET              0x03c8  /* Low Power Mode Security Attribution Register (32-bits) */
#define R_SYSTEM_PVDSAR_OFFSET              0x03cc  /* Programmable Voltage Detection Security Attribution Register (32-bits) */
#define R_SYSTEM_BBFSAR_OFFSET              0x03d0  /* Battery Backup Function Security Attribute Register (32-bits) */
#define R_SYSTEM_PGCSAR_OFFSET              0x03d8  /* Power Gating Control Security Attribution Register (32-bits) */
#define R_SYSTEM_DPFSAR_OFFSET              0x03e0  /* Deep Standby Interrupt Factor Security Attribution Register (32-bits) */
#define R_SYSTEM_RSCSAR_OFFSET              0x03e4  /* RAM Standby Control Security Attribution Register (32-bits) */
#define R_SYSTEM_PRCR_S_OFFSET              0x03fa  /* Protect Register for Secure Register (16-bits) */
#define R_SYSTEM_PRCR_NS_OFFSET             0x03fe  /* Protect Register for Non-secure Register (16-bits) */
#define R_SYSTEM_LOCOCR_OFFSET              0x0400  /* Low-Speed On-Chip Oscillator Control Register (8-bits) */
#define R_SYSTEM_LOCOUTCR_OFFSET            0x0402  /* LOCO User Trimming Control Register (8-bits) */
#define R_SYSTEM_DPSBYCR_OFFSET             0x0a00  /* Deep Standby Control Register (8-bits) */
#define R_SYSTEM_DPSWCR_OFFSET              0x0a04  /* Deep Standby Wait Control Register (8-bits) */
#define R_SYSTEM_DPSIER0_OFFSET             0x0a08  /* Deep Standby Interrupt Enable Register 0 (8-bits) */
#define R_SYSTEM_DPSIER1_OFFSET             0x0a0c  /* Deep Standby Interrupt Enable Register 1 (8-bits) */
#define R_SYSTEM_DPSIER2_OFFSET             0x0a10  /* Deep Standby Interrupt Enable Register 2 (8-bits) */
#define R_SYSTEM_DPSIER3_OFFSET             0x0a14  /* Deep Standby Interrupt Enable Register 3 (8-bits) */
#define R_SYSTEM_DPSIFR0_OFFSET             0x0a18  /* Deep Standby Interrupt Flag Register 0 (8-bits) */
#define R_SYSTEM_DPSIFR1_OFFSET             0x0a1c  /* Deep Standby Interrupt Flag Register 1 (8-bits) */
#define R_SYSTEM_DPSIFR2_OFFSET             0x0a20  /* Deep Standby Interrupt Flag Register 2 (8-bits) */
#define R_SYSTEM_DPSIFR3_OFFSET             0x0a24  /* Deep Standby Interrupt Flag Register 3 (8-bits) */
#define R_SYSTEM_DPSIEGR0_OFFSET            0x0a28  /* Deep Standby Interrupt Edge Register 0 (8-bits) */
#define R_SYSTEM_DPSIEGR1_OFFSET            0x0a2c  /* Deep Standby Interrupt Edge Register 1 (8-bits) */
#define R_SYSTEM_DPSIEGR2_OFFSET            0x0a30  /* Deep Standby Interrupt Edge Register 2 (8-bits) */
#define R_SYSTEM_SYOCDCR_OFFSET             0x0a38  /* System Control OCD Control Register (8-bits) */
#define R_SYSTEM_RSTSR0_OFFSET              0x0a40  /* Reset Status Register 0 (8-bits) */
#define R_SYSTEM_RSTSR2_OFFSET              0x0a44  /* Reset Status Register 2 (8-bits) */
#define R_SYSTEM_RSTSR3_OFFSET              0x0a48  /* Reset Status Register 3 (8-bits) */
#define R_SYSTEM_MOMCR_OFFSET               0x0a50  /* Main Clock Oscillator Mode Oscillation Control Register (8-bits) */
#define R_SYSTEM_FWEPROR_OFFSET             0x0a54  /* Flash Write Erase Protect Register (8-bits) */
#define R_SYSTEM_PVD1CMPCR_OFFSET           0x0a58  /* Voltage Monitor 1 Comparator Control Register (8-bits) */
#define R_SYSTEM_PVD2CMPCR_OFFSET           0x0a5c  /* Voltage Monitor 2 Comparator Control Register (8-bits) */
#define R_SYSTEM_PVDCR0_OFFSET              0x0a70  /* Voltage Monitor %s Circuit Control Register 0 (8-bits) */
#define R_SYSTEM_VBATTMNSELR_OFFSET         0x0a84  /* Battery Backup Voltage Monitor Function Select Register (8-bits) */
#define R_SYSTEM_VBTBPCR1_OFFSET            0x0a88  /* VBATT Battery Power Supply Control Register 1 (8-bits) */
#define R_SYSTEM_LPSCR_OFFSET               0x0a90  /* Low Power State Control Register (8-bits) */
#define R_SYSTEM_SSCR1_OFFSET               0x0a98  /* Software Standby Control Register 1 (8-bits) */
#define R_SYSTEM_LVOCR_OFFSET               0x0ab0  /* Low Power State Control Register (8-bits) */
#define R_SYSTEM_SYRSTMSK0_OFFSET           0x0ad0  /* System Reset Mask Control Register0 (8-bits) */
#define R_SYSTEM_SYRSTMSK1_OFFSET           0x0ad4  /* System Reset Mask Control Register1 (8-bits) */
#define R_SYSTEM_SYRSTMSK2_OFFSET           0x0ad8  /* System Reset Mask Control Register2 (8-bits) */
#define R_SYSTEM_PLL1LDOCR_OFFSET           0x0b04  /* PLL1-LDO Control Register (8-bits) */
#define R_SYSTEM_PLL2LDOCR_OFFSET           0x0b08  /* PLL2-LDO Control Register (8-bits) */
#define R_SYSTEM_HOCOLDOCR_OFFSET           0x0b0c  /* HOCO-LDO Control Register (8-bits) */
#define R_SYSTEM_MOMCR2_OFFSET              0x0b10  /* Main Clock Oscillator Mode Control Register 2 (8-bits) */
#define R_SYSTEM_SOSCCR_OFFSET              0x0c00  /* Sub-clock oscillator control register (8-bits) */
#define R_SYSTEM_SOMCR_OFFSET               0x0c01  /* Sub Clock Oscillator Mode Control Register (8-bits) */
#define R_SYSTEM_VBTBER_OFFSET              0x0c40  /* VBATT Backup Enable Register (8-bits) */
#define R_SYSTEM_VBTBPCR2_OFFSET            0x0c45  /* VBATT Battery Power Supply Control Register 2 (8-bits) */
#define R_SYSTEM_VBTBPSR_OFFSET             0x0c46  /* VBATT Battery Power Supply Status Register (8-bits) */
#define R_SYSTEM_VBTADSR_OFFSET             0x0c48  /* VBATT Tamper detection Status Register (8-bits) */
#define R_SYSTEM_VBTADCR1_OFFSET            0x0c49  /* VBATT Tamper detection Control Register 1 (8-bits) */
#define R_SYSTEM_VBTADCR2_OFFSET            0x0c4a  /* VBATT Tamper detection Control Register 2 (8-bits) */
#define R_SYSTEM_VBTICTLR_OFFSET            0x0c4c  /* VBATT Input Control Register (8-bits) */
#define R_SYSTEM_VBTICTLR2_OFFSET           0x0c4d  /* VBATT Input Control Register 2 (8-bits) */
#define R_SYSTEM_VBTIMONR_OFFSET            0x0c4e  /* VBATT Input Monitor Register (8-bits) */
#define R_SYSTEM_VBTBKR_OFFSET              0x0d00  /* VBATT Backup Register %s (8-bits) */

