apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* Register Addresses *******************************************************/

/* SYSTEM Registers */

#define R_SYSTEM_SBYCR                     (R_SYSTEM_BASE + R_SYSTEM_SBYCR_OFFSET)
#define R_SYSTEM_SSCR2                     (R_SYSTEM_BASE + R_SYSTEM_SSCR2_OFFSET)
#define R_SYSTEM_FLSCR                     (R_SYSTEM_BASE + R_SYSTEM_FLSCR_OFFSET)
#define R_SYSTEM_SCKDIVCR                  (R_SYSTEM_BASE + R_SYSTEM_SCKDIVCR_OFFSET)
#define R_SYSTEM_SCKDIVCR2                 (R_SYSTEM_BASE + R_SYSTEM_SCKDIVCR2_OFFSET)
#define R_SYSTEM_SCKSCR                    (R_SYSTEM_BASE + R_SYSTEM_SCKSCR_OFFSET)
#define R_SYSTEM_PLLCCR                    (R_SYSTEM_BASE + R_SYSTEM_PLLCCR_OFFSET)
#define R_SYSTEM_PLLCR                     (R_SYSTEM_BASE + R_SYSTEM_PLLCR_OFFSET)
#define R_SYSTEM_BCKCR                     (R_SYSTEM_BASE + R_SYSTEM_BCKCR_OFFSET)
#define R_SYSTEM_MOSCCR                    (R_SYSTEM_BASE + R_SYSTEM_MOSCCR_OFFSET)
#define R_SYSTEM_HOCOCR                    (R_SYSTEM_BASE + R_SYSTEM_HOCOCR_OFFSET)
#define R_SYSTEM_MOCOCR                    (R_SYSTEM_BASE + R_SYSTEM_MOCOCR_OFFSET)
#define R_SYSTEM_FLLCR1                    (R_SYSTEM_BASE + R_SYSTEM_FLLCR1_OFFSET)
#define R_SYSTEM_FLLCR2                    (R_SYSTEM_BASE + R_SYSTEM_FLLCR2_OFFSET)
#define R_SYSTEM_OSCSF                     (R_SYSTEM_BASE + R_SYSTEM_OSCSF_OFFSET)
#define R_SYSTEM_CKOCR                     (R_SYSTEM_BASE + R_SYSTEM_CKOCR_OFFSET)
#define R_SYSTEM_TRCKCR                    (R_SYSTEM_BASE + R_SYSTEM_TRCKCR_OFFSET)
#define R_SYSTEM_OSTDCR                    (R_SYSTEM_BASE + R_SYSTEM_OSTDCR_OFFSET)
#define R_SYSTEM_OSTDSR                    (R_SYSTEM_BASE + R_SYSTEM_OSTDSR_OFFSET)
#define R_SYSTEM_OSCMONR                   (R_SYSTEM_BASE + R_SYSTEM_OSCMONR_OFFSET)
#define R_SYSTEM_PLL2CCR                   (R_SYSTEM_BASE + R_SYSTEM_PLL2CCR_OFFSET)
#define R_SYSTEM_PLL2CR                    (R_SYSTEM_BASE + R_SYSTEM_PLL2CR_OFFSET)
#define R_SYSTEM_PLLCCR2                   (R_SYSTEM_BASE + R_SYSTEM_PLLCCR2_OFFSET)
#define R_SYSTEM_PLL2CCR2                  (R_SYSTEM_BASE + R_SYSTEM_PLL2CCR2_OFFSET)
#define R_SYSTEM_EBCKOCR                   (R_SYSTEM_BASE + R_SYSTEM_EBCKOCR_OFFSET)
#define R_SYSTEM_SDCKOCR                   (R_SYSTEM_BASE + R_SYSTEM_SDCKOCR_OFFSET)
#define R_SYSTEM_SCICKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_SCICKDIVCR_OFFSET)
#define R_SYSTEM_SCICKCR                   (R_SYSTEM_BASE + R_SYSTEM_SCICKCR_OFFSET)
#define R_SYSTEM_SPICKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_SPICKDIVCR_OFFSET)
#define R_SYSTEM_SPICKCR                   (R_SYSTEM_BASE + R_SYSTEM_SPICKCR_OFFSET)
#define R_SYSTEM_ADCCKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_ADCCKDIVCR_OFFSET)
#define R_SYSTEM_ADCCKCR                   (R_SYSTEM_BASE + R_SYSTEM_ADCCKCR_OFFSET)
#define R_SYSTEM_GPTCKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_GPTCKDIVCR_OFFSET)
#define R_SYSTEM_GPTCKCR                   (R_SYSTEM_BASE + R_SYSTEM_GPTCKCR_OFFSET)
#define R_SYSTEM_LCDCKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_LCDCKDIVCR_OFFSET)
#define R_SYSTEM_LCDCKCR                   (R_SYSTEM_BASE + R_SYSTEM_LCDCKCR_OFFSET)
#define R_SYSTEM_MOCOUTCR                  (R_SYSTEM_BASE + R_SYSTEM_MOCOUTCR_OFFSET)
#define R_SYSTEM_HOCOUTCR                  (R_SYSTEM_BASE + R_SYSTEM_HOCOUTCR_OFFSET)
#define R_SYSTEM_USBCKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_USBCKDIVCR_OFFSET)
#define R_SYSTEM_OCTACKDIVCR               (R_SYSTEM_BASE + R_SYSTEM_OCTACKDIVCR_OFFSET)
#define R_SYSTEM_CANFDCKDIVCR              (R_SYSTEM_BASE + R_SYSTEM_CANFDCKDIVCR_OFFSET)
#define R_SYSTEM_USB60CKDIVCR              (R_SYSTEM_BASE + R_SYSTEM_USB60CKDIVCR_OFFSET)
#define R_SYSTEM_I3CCKDIVCR                (R_SYSTEM_BASE + R_SYSTEM_I3CCKDIVCR_OFFSET)
#define R_SYSTEM_USBCKCR                   (R_SYSTEM_BASE + R_SYSTEM_USBCKCR_OFFSET)
#define R_SYSTEM_OCTACKCR                  (R_SYSTEM_BASE + R_SYSTEM_OCTACKCR_OFFSET)
#define R_SYSTEM_CANFDCKCR                 (R_SYSTEM_BASE + R_SYSTEM_CANFDCKCR_OFFSET)
#define R_SYSTEM_USB60CKCR                 (R_SYSTEM_BASE + R_SYSTEM_USB60CKCR_OFFSET)
#define R_SYSTEM_I3CCKCR                   (R_SYSTEM_BASE + R_SYSTEM_I3CCKCR_OFFSET)
#define R_SYSTEM_MOSCSCR                   (R_SYSTEM_BASE + R_SYSTEM_MOSCSCR_OFFSET)
#define R_SYSTEM_HOCOSCR                   (R_SYSTEM_BASE + R_SYSTEM_HOCOSCR_OFFSET)
#define R_SYSTEM_OPCCR                     (R_SYSTEM_BASE + R_SYSTEM_OPCCR_OFFSET)
#define R_SYSTEM_MOSCWTCR                  (R_SYSTEM_BASE + R_SYSTEM_MOSCWTCR_OFFSET)
#define R_SYSTEM_RSTSR1                    (R_SYSTEM_BASE + R_SYSTEM_RSTSR1_OFFSET)
#define R_SYSTEM_SYRACCR                   (R_SYSTEM_BASE + R_SYSTEM_SYRACCR_OFFSET)
#define R_SYSTEM_PVDCR1(p)                 (R_SYSTEM_BASE + R_SYSTEM_PVDCR1_OFFSET + (p)*0x0002)
#define R_SYSTEM_PVDSR(p)                  (R_SYSTEM_BASE + R_SYSTEM_PVDSR_OFFSET + (p)*0x0002)
#define R_SYSTEM_CRVSYSCR                  (R_SYSTEM_BASE + R_SYSTEM_CRVSYSCR_OFFSET)
#define R_SYSTEM_PDCTRGD                   (R_SYSTEM_BASE + R_SYSTEM_PDCTRGD_OFFSET)
#define R_SYSTEM_PDRAMSCR0                 (R_SYSTEM_BASE + R_SYSTEM_PDRAMSCR0_OFFSET)
#define R_SYSTEM_PDRAMSCR1                 (R_SYSTEM_BASE + R_SYSTEM_PDRAMSCR1_OFFSET)
#define R_SYSTEM_VBRSABAR                  (R_SYSTEM_BASE + R_SYSTEM_VBRSABAR_OFFSET)
#define R_SYSTEM_VBRPABARS                 (R_SYSTEM_BASE + R_SYSTEM_VBRPABARS_OFFSET)
#define R_SYSTEM_VBRPABARNS                (R_SYSTEM_BASE + R_SYSTEM_VBRPABARNS_OFFSET)
#define R_SYSTEM_CGFSAR                    (R_SYSTEM_BASE + R_SYSTEM_CGFSAR_OFFSET)
#define R_SYSTEM_RSTSAR                    (R_SYSTEM_BASE + R_SYSTEM_RSTSAR_OFFSET)
#define R_SYSTEM_LPMSAR                    (R_SYSTEM_BASE + R_SYSTEM_LPMSAR_OFFSET)
#define R_SYSTEM_PVDSAR                    (R_SYSTEM_BASE + R_SYSTEM_PVDSAR_OFFSET)
#define R_SYSTEM_BBFSAR                    (R_SYSTEM_BASE + R_SYSTEM_BBFSAR_OFFSET)
#define R_SYSTEM_PGCSAR                    (R_SYSTEM_BASE + R_SYSTEM_PGCSAR_OFFSET)
#define R_SYSTEM_DPFSAR                    (R_SYSTEM_BASE + R_SYSTEM_DPFSAR_OFFSET)
#define R_SYSTEM_RSCSAR                    (R_SYSTEM_BASE + R_SYSTEM_RSCSAR_OFFSET)
#define R_SYSTEM_PRCR_S                    (R_SYSTEM_BASE + R_SYSTEM_PRCR_S_OFFSET)
#define R_SYSTEM_PRCR_NS                   (R_SYSTEM_BASE + R_SYSTEM_PRCR_NS_OFFSET)
#define R_SYSTEM_LOCOCR                    (R_SYSTEM_BASE + R_SYSTEM_LOCOCR_OFFSET)
#define R_SYSTEM_LOCOUTCR                  (R_SYSTEM_BASE + R_SYSTEM_LOCOUTCR_OFFSET)
#define R_SYSTEM_DPSBYCR                   (R_SYSTEM_BASE + R_SYSTEM_DPSBYCR_OFFSET)
#define R_SYSTEM_DPSWCR                    (R_SYSTEM_BASE + R_SYSTEM_DPSWCR_OFFSET)
#define R_SYSTEM_DPSIER0                   (R_SYSTEM_BASE + R_SYSTEM_DPSIER0_OFFSET)
#define R_SYSTEM_DPSIER1                   (R_SYSTEM_BASE + R_SYSTEM_DPSIER1_OFFSET)
#define R_SYSTEM_DPSIER2                   (R_SYSTEM_BASE + R_SYSTEM_DPSIER2_OFFSET)
#define R_SYSTEM_DPSIER3                   (R_SYSTEM_BASE + R_SYSTEM_DPSIER3_OFFSET)
#define R_SYSTEM_DPSIFR0                   (R_SYSTEM_BASE + R_SYSTEM_DPSIFR0_OFFSET)
#define R_SYSTEM_DPSIFR1                   (R_SYSTEM_BASE + R_SYSTEM_DPSIFR1_OFFSET)
#define R_SYSTEM_DPSIFR2                   (R_SYSTEM_BASE + R_SYSTEM_DPSIFR2_OFFSET)
#define R_SYSTEM_DPSIFR3                   (R_SYSTEM_BASE + R_SYSTEM_DPSIFR3_OFFSET)
#define R_SYSTEM_DPSIEGR0                  (R_SYSTEM_BASE + R_SYSTEM_DPSIEGR0_OFFSET)
#define R_SYSTEM_DPSIEGR1                  (R_SYSTEM_BASE + R_SYSTEM_DPSIEGR1_OFFSET)
#define R_SYSTEM_DPSIEGR2                  (R_SYSTEM_BASE + R_SYSTEM_DPSIEGR2_OFFSET)
#define R_SYSTEM_SYOCDCR                   (R_SYSTEM_BASE + R_SYSTEM_SYOCDCR_OFFSET)
#define R_SYSTEM_RSTSR0                    (R_SYSTEM_BASE + R_SYSTEM_RSTSR0_OFFSET)
#define R_SYSTEM_RSTSR2                    (R_SYSTEM_BASE + R_SYSTEM_RSTSR2_OFFSET)
#define R_SYSTEM_RSTSR3                    (R_SYSTEM_BASE + R_SYSTEM_RSTSR3_OFFSET)
#define R_SYSTEM_MOMCR                     (R_SYSTEM_BASE + R_SYSTEM_MOMCR_OFFSET)
#define R_SYSTEM_FWEPROR                   (R_SYSTEM_BASE + R_SYSTEM_FWEPROR_OFFSET)
#define R_SYSTEM_PVD1CMPCR                 (R_SYSTEM_BASE + R_SYSTEM_PVD1CMPCR_OFFSET)
#define R_SYSTEM_PVD2CMPCR                 (R_SYSTEM_BASE + R_SYSTEM_PVD2CMPCR_OFFSET)
#define R_SYSTEM_PVDCR0(p)                 (R_SYSTEM_BASE + R_SYSTEM_PVDCR0_OFFSET + (p)*0x0004)
#define R_SYSTEM_VBATTMNSELR               (R_SYSTEM_BASE + R_SYSTEM_VBATTMNSELR_OFFSET)
#define R_SYSTEM_VBTBPCR1                  (R_SYSTEM_BASE + R_SYSTEM_VBTBPCR1_OFFSET)
#define R_SYSTEM_LPSCR                     (R_SYSTEM_BASE + R_SYSTEM_LPSCR_OFFSET)
#define R_SYSTEM_SSCR1                     (R_SYSTEM_BASE + R_SYSTEM_SSCR1_OFFSET)
#define R_SYSTEM_LVOCR                     (R_SYSTEM_BASE + R_SYSTEM_LVOCR_OFFSET)
#define R_SYSTEM_SYRSTMSK0                 (R_SYSTEM_BASE + R_SYSTEM_SYRSTMSK0_OFFSET)
#define R_SYSTEM_SYRSTMSK1                 (R_SYSTEM_BASE + R_SYSTEM_SYRSTMSK1_OFFSET)
#define R_SYSTEM_SYRSTMSK2                 (R_SYSTEM_BASE + R_SYSTEM_SYRSTMSK2_OFFSET)
#define R_SYSTEM_PLL1LDOCR                 (R_SYSTEM_BASE + R_SYSTEM_PLL1LDOCR_OFFSET)
#define R_SYSTEM_PLL2LDOCR                 (R_SYSTEM_BASE + R_SYSTEM_PLL2LDOCR_OFFSET)
#define R_SYSTEM_HOCOLDOCR                 (R_SYSTEM_BASE + R_SYSTEM_HOCOLDOCR_OFFSET)
#define R_SYSTEM_MOMCR2                    (R_SYSTEM_BASE + R_SYSTEM_MOMCR2_OFFSET)
#define R_SYSTEM_SOSCCR                    (R_SYSTEM_BASE + R_SYSTEM_SOSCCR_OFFSET)
#define R_SYSTEM_SOMCR                     (R_SYSTEM_BASE + R_SYSTEM_SOMCR_OFFSET)
#define R_SYSTEM_VBTBER                    (R_SYSTEM_BASE + R_SYSTEM_VBTBER_OFFSET)
#define R_SYSTEM_VBTBPCR2                  (R_SYSTEM_BASE + R_SYSTEM_VBTBPCR2_OFFSET)
#define R_SYSTEM_VBTBPSR                   (R_SYSTEM_BASE + R_SYSTEM_VBTBPSR_OFFSET)
#define R_SYSTEM_VBTADSR                   (R_SYSTEM_BASE + R_SYSTEM_VBTADSR_OFFSET)
#define R_SYSTEM_VBTADCR1                  (R_SYSTEM_BASE + R_SYSTEM_VBTADCR1_OFFSET)
#define R_SYSTEM_VBTADCR2                  (R_SYSTEM_BASE + R_SYSTEM_VBTADCR2_OFFSET)
#define R_SYSTEM_VBTICTLR                  (R_SYSTEM_BASE + R_SYSTEM_VBTICTLR_OFFSET)
#define R_SYSTEM_VBTICTLR2                 (R_SYSTEM_BASE + R_SYSTEM_VBTICTLR2_OFFSET)
#define R_SYSTEM_VBTIMONR                  (R_SYSTEM_BASE + R_SYSTEM_VBTIMONR_OFFSET)
#define R_SYSTEM_VBTBKR(p)                 (R_SYSTEM_BASE + R_SYSTEM_VBTBKR_OFFSET + (p)*0x0001)

/* Register Bitfield Definitions ********************************************/

/* Standby Control Register (8-bits) ****************************************/

