apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_SBYCR_OPE (1 <<  6)  /* 40: Output Port Enable */

/* Software Standby Control Register 2 (8-bits) *****************************/

#define R_SYSTEM_SSCR2_SS1RSF (1 <<  0)  /* 01: Software Standby 1 regulator status flag */

/* Flash Standby Control Register (8-bits) **********************************/

#define R_SYSTEM_FLSCR_FLSWCF (1 <<  0)  /* 01: Flash Stabilization wait completion flag */

/* System Clock Division Control Register (32-bits) *************************/

#define R_SYSTEM_SCKDIVCR_PCKD_SHIFT (0)
#define R_SYSTEM_SCKDIVCR_PCKD_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_PCKD_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_2 (1 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_4 (2 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_8 (3 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_16 (4 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                /* /16 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_32 (5 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                /* /32 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_64 (6 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                /* /64 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_3 (8 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_6 (9 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCKDIVCR_PCKD_DIV_12 (10 << R_SYSTEM_SCKDIVCR_PCKD_SHIFT)               /* /12 */
#define R_SYSTEM_SCKDIVCR_PCKC_SHIFT (4)
#define R_SYSTEM_SCKDIVCR_PCKC_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_PCKC_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_2 (1 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_4 (2 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_8 (3 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_16 (4 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                /* /16 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_32 (5 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                /* /32 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_64 (6 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                /* /64 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_3 (8 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_6 (9 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCKDIVCR_PCKC_DIV_12 (10 << R_SYSTEM_SCKDIVCR_PCKC_SHIFT)               /* /12 */
#define R_SYSTEM_SCKDIVCR_PCKB_SHIFT (8)
#define R_SYSTEM_SCKDIVCR_PCKB_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_PCKB_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_2 (1 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_4 (2 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_8 (3 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_16 (4 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                /* /16 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_32 (5 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                /* /32 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_64 (6 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                /* /64 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_3 (8 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_6 (9 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCKDIVCR_PCKB_DIV_12 (10 << R_SYSTEM_SCKDIVCR_PCKB_SHIFT)               /* /12 */
#define R_SYSTEM_SCKDIVCR_PCKA_SHIFT (12)
#define R_SYSTEM_SCKDIVCR_PCKA_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_PCKA_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_2 (1 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_4 (2 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_8 (3 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_16 (4 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                /* /16 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_32 (5 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                /* /32 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_64 (6 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                /* /64 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_3 (8 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_6 (9 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCKDIVCR_PCKA_DIV_12 (10 << R_SYSTEM_SCKDIVCR_PCKA_SHIFT)               /* /12 */
#define R_SYSTEM_SCKDIVCR_BCK_SHIFT (16)
#define R_SYSTEM_SCKDIVCR_BCK_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_BCK_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)    /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_2 (1 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                   /* /2 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_4 (2 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                   /* /4 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_8 (3 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                   /* /8 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_16 (4 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                  /* /16 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_32 (5 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                  /* /32 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_64 (6 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                  /* /64 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_3 (8 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                   /* /3 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_6 (9 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                   /* /6 */
#  define R_SYSTEM_SCKDIVCR_BCK_DIV_12 (10 << R_SYSTEM_SCKDIVCR_BCK_SHIFT)                 /* /12 */
#define R_SYSTEM_SCKDIVCR_PCKE_SHIFT (20)
#define R_SYSTEM_SCKDIVCR_PCKE_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_PCKE_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_2 (1 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_4 (2 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_8 (3 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_16 (4 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                /* /16 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_32 (5 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                /* /32 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_64 (6 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                /* /64 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_3 (8 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_6 (9 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCKDIVCR_PCKE_DIV_12 (10 << R_SYSTEM_SCKDIVCR_PCKE_SHIFT)               /* /12 */
#define R_SYSTEM_SCKDIVCR_ICK_SHIFT (24)
#define R_SYSTEM_SCKDIVCR_ICK_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_ICK_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)    /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_2 (1 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                   /* /2 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_4 (2 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                   /* /4 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_8 (3 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                   /* /8 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_16 (4 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                  /* /16 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_32 (5 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                  /* /32 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_64 (6 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                  /* /64 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_3 (8 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                   /* /3 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_6 (9 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                   /* /6 */
#  define R_SYSTEM_SCKDIVCR_ICK_DIV_12 (10 << R_SYSTEM_SCKDIVCR_ICK_SHIFT)                 /* /12 */
#define R_SYSTEM_SCKDIVCR_FCK_SHIFT (28)
#define R_SYSTEM_SCKDIVCR_FCK_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR_FCK_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)    /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_2 (1 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                   /* /2 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_4 (2 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                   /* /4 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_8 (3 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                   /* /8 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_16 (4 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                  /* /16 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_32 (5 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                  /* /32 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_64 (6 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                  /* /64 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_3 (8 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                   /* /3 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_6 (9 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                   /* /6 */
#  define R_SYSTEM_SCKDIVCR_FCK_DIV_12 (10 << R_SYSTEM_SCKDIVCR_FCK_SHIFT)                 /* /12 */

/* System Clock Division Control Register 2 (8-bits) ************************/

#define R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT (0)
#define R_SYSTEM_SCKDIVCR2_CPUCK_MASK (0xf)
#  define R_SYSTEM_SCKDIVCR2_CPUCK_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_2 (1 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_4 (2 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_8 (3 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_16 (4 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                /* /16 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_32 (5 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                /* /32 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_64 (6 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                /* /64 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_3 (8 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_6 (9 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCKDIVCR2_CPUCK_DIV_12 (10 << R_SYSTEM_SCKDIVCR2_CPUCK_SHIFT)               /* /12 */

/* System Clock Source Control Register (8-bits) ****************************/

