apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_SCKSCR_CKSEL_SHIFT (0)
#define R_SYSTEM_SCKSCR_CKSEL_MASK (0x7)
#  define R_SYSTEM_SCKSCR_CKSEL_HOCO (0 << R_SYSTEM_SCKSCR_CKSEL_SHIFT)                   /* HOCO */
#  define R_SYSTEM_SCKSCR_CKSEL_MOCO (1 << R_SYSTEM_SCKSCR_CKSEL_SHIFT)                   /* MOCO */
#  define R_SYSTEM_SCKSCR_CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_SCKSCR_CKSEL_SHIFT)  /* Main clock oscillator */
#  define R_SYSTEM_SCKSCR_CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_SCKSCR_CKSEL_SHIFT)   /* Sub-clock oscillator */
#  define R_SYSTEM_SCKSCR_CKSEL_PLL (5 << R_SYSTEM_SCKSCR_CKSEL_SHIFT)                    /* PLL */

/* PLL Clock Control Register (16-bits) *************************************/

#define R_SYSTEM_PLLCCR_PLIDIV_SHIFT (0)
#define R_SYSTEM_PLLCCR_PLIDIV_MASK (0x3)
#  define R_SYSTEM_PLLCCR_PLIDIV_DIV_1 (0 << R_SYSTEM_PLLCCR_PLIDIV_SHIFT)                        /* /1 */
#  define R_SYSTEM_PLLCCR_PLIDIV_DIV_2 (1 << R_SYSTEM_PLLCCR_PLIDIV_SHIFT)                        /* /2 */
#  define R_SYSTEM_PLLCCR_PLIDIV_DIV_3 (2 << R_SYSTEM_PLLCCR_PLIDIV_SHIFT)                        /* /3 */
#  define R_SYSTEM_PLLCCR_PLIDIV_SETTING_PROHIBITED (3 << R_SYSTEM_PLLCCR_PLIDIV_SHIFT)           /* Setting prohibited */
#define R_SYSTEM_PLLCCR_PLSRCSEL (1 <<  4)                                                        /* 10: PLL1 Clock Source Select */
#define R_SYSTEM_PLLCCR_PLLMULNF_SHIFT (6)
#define R_SYSTEM_PLLCCR_PLLMULNF_MASK (0x3)
#  define R_SYSTEM_PLLCCR_PLLMULNF_V0_00_VALUE_AFTER_RESET (0 << R_SYSTEM_PLLCCR_PLLMULNF_SHIFT)  /* 0.00 (Value after reset) */
#  define R_SYSTEM_PLLCCR_PLLMULNF_V0_33_1_3 (1 << R_SYSTEM_PLLCCR_PLLMULNF_SHIFT)                /* 0.33 (1/3) */
#  define R_SYSTEM_PLLCCR_PLLMULNF_V0_66_2_3 (2 << R_SYSTEM_PLLCCR_PLLMULNF_SHIFT)                /* 0.66 (2/3) */
#  define R_SYSTEM_PLLCCR_PLLMULNF_V0_50_1_2 (3 << R_SYSTEM_PLLCCR_PLLMULNF_SHIFT)                /* 0.50 (1/2) */
#define R_SYSTEM_PLLCCR_PLLMUL_SHIFT (8)
#define R_SYSTEM_PLLCCR_PLLMUL_MASK (0xff)
#  define R_SYSTEM_PLLCCR_PLLMUL_V26_VALUE_AFTER_RESET (25 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)       /* ×26 (Value after reset) */
#  define R_SYSTEM_PLLCCR_PLLMUL_V27 (26 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                         /* ×27 */
#  define R_SYSTEM_PLLCCR_PLLMUL_V28 (27 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                         /* ×28 */
#  define R_SYSTEM_PLLCCR_PLLMUL_V89 (88 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                         /* ×89 */
#  define R_SYSTEM_PLLCCR_PLLMUL_V90 (89 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                         /* ×90 */
#  define R_SYSTEM_PLLCCR_PLLMUL_V91 (90 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                         /* ×91 */
#  define R_SYSTEM_PLLCCR_PLLMUL_V179 (178 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                       /* ×179 */
#  define R_SYSTEM_PLLCCR_PLLMUL_V180 (179 << R_SYSTEM_PLLCCR_PLLMUL_SHIFT)                       /* ×180 */

/* PLL Control Register (8-bits) ********************************************/

#define R_SYSTEM_PLLCR_PLLSTP (1 <<  0)  /* 01: PLL1 Stop Control */

/* External Bus Clock Control Register (8-bits) *****************************/

#define R_SYSTEM_BCKCR_BCLKDIV (1 <<  0)  /* 01: BCLK Pin Output Select */

/* Main Clock Oscillator Control Register (8-bits) **************************/

#define R_SYSTEM_MOSCCR_MOSTP (1 <<  0)  /* 01: Main Clock Oscillator Stop */

/* High-Speed On-Chip Oscillator Control Register (8-bits) ******************/

#define R_SYSTEM_HOCOCR_HCSTP (1 <<  0)  /* 01: HOCO Stop */

/* Middle-Speed On-Chip Oscillator Control Register (8-bits) ****************/

#define R_SYSTEM_MOCOCR_MCSTP (1 <<  0)  /* 01: MOCO Stop */

/* FLL Control Register 1 (8-bits) ******************************************/

#define R_SYSTEM_FLLCR1_FLLEN (1 <<  0)  /* 01: FLL Enable */

/* FLL Control Register 2 (16-bits) *****************************************/

#define R_SYSTEM_FLLCR2_FLLCNTL_SHIFT (0)
#define R_SYSTEM_FLLCR2_FLLCNTL_MASK (0x7ff)

/* Oscillation Stabilization Flag Register (8-bits) *************************/

#define R_SYSTEM_OSCSF_HOCOSF (1 <<  0)  /* 01: HOCO Clock Oscillation Stabilization FlagNOTE: The HOCOSF bit value after a reset is 1 when the OFS1.HOCOEN bit is 0. It is 0 when the OFS1.HOCOEN bit is 1. */
#define R_SYSTEM_OSCSF_MOSCSF (1 <<  3)  /* 08: Main Clock Oscillation Stabilization Flag */
#define R_SYSTEM_OSCSF_PLLSF (1 <<  5)   /* 20: PLL1 Clock Oscillation Stabilization Flag */
#define R_SYSTEM_OSCSF_PLL2SF (1 <<  6)  /* 40: PLL2 Clock Oscillation Stabilization Flag */

/* Clock Out Control Register (8-bits) **************************************/

#define R_SYSTEM_CKOCR_CKODIV_SHIFT (4)
#define R_SYSTEM_CKOCR_CKODIV_MASK (0x7)
#  define R_SYSTEM_CKOCR_CKODIV_DIV_1 (0 << R_SYSTEM_CKOCR_CKODIV_SHIFT)    /* /1 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_2 (1 << R_SYSTEM_CKOCR_CKODIV_SHIFT)    /* /2 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_4 (2 << R_SYSTEM_CKOCR_CKODIV_SHIFT)    /* /4 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_8 (3 << R_SYSTEM_CKOCR_CKODIV_SHIFT)    /* /8 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_16 (4 << R_SYSTEM_CKOCR_CKODIV_SHIFT)   /* /16 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_32 (5 << R_SYSTEM_CKOCR_CKODIV_SHIFT)   /* /32 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_64 (6 << R_SYSTEM_CKOCR_CKODIV_SHIFT)   /* /64 */
#  define R_SYSTEM_CKOCR_CKODIV_DIV_128 (7 << R_SYSTEM_CKOCR_CKODIV_SHIFT)  /* /128 */
#define R_SYSTEM_CKOCR_CKOEN (1 <<  7)                                      /* 80: Clock out enable */

/* Trace Clock Control Register (8-bits) ************************************/

#define R_SYSTEM_TRCKCR_TRCK_SHIFT (0)
#define R_SYSTEM_TRCKCR_TRCK_MASK (0xf)
#define R_SYSTEM_TRCKCR_TRCKSEL (1 <<  4)  /* 10: Trace Clock source select */
#define R_SYSTEM_TRCKCR_TRCKEN (1 <<  7)   /* 80: Trace Clock operating Enable */

/* Oscillation Stop Detection Control Register (8-bits) *********************/

#define R_SYSTEM_OSTDCR_OSTDIE (1 <<  0)  /* 01: Oscillation Stop Detection Interrupt Enable */
#define R_SYSTEM_OSTDCR_OSTDE (1 <<  7)   /* 80: Oscillation Stop Detection Function Enable */

/* Oscillation Stop Detection Status Register (8-bits) **********************/

#define R_SYSTEM_OSTDSR_OSTDF (1 <<  0)  /* 01: Oscillation Stop Detection Flag */

/* Oscillator Monitor Register (8-bits) *************************************/

#define R_SYSTEM_OSCMONR_MOCOMON (1 <<  1)  /* 02: MOCO operation monitor */
#define R_SYSTEM_OSCMONR_LOCOMON (1 <<  2)  /* 04: LOCO operation monitor */

