apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* PLL2 Clock Control Register (16-bits) ************************************/

#define R_SYSTEM_PLL2CCR_PL2IDIV_SHIFT (0)
#define R_SYSTEM_PLL2CCR_PL2IDIV_MASK (0x3)
#  define R_SYSTEM_PLL2CCR_PL2IDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_PLL2CCR_PL2IDIV_SHIFT)         /* /1 (Value after reset) */
#  define R_SYSTEM_PLL2CCR_PL2IDIV_DIV_2 (1 << R_SYSTEM_PLL2CCR_PL2IDIV_SHIFT)                        /* /2 */
#  define R_SYSTEM_PLL2CCR_PL2IDIV_DIV_3 (2 << R_SYSTEM_PLL2CCR_PL2IDIV_SHIFT)                        /* /3 */
#  define R_SYSTEM_PLL2CCR_PL2IDIV_DIV_4 (3 << R_SYSTEM_PLL2CCR_PL2IDIV_SHIFT)                        /* /4 */
#define R_SYSTEM_PLL2CCR_PL2SRCSEL (1 <<  4)                                                          /* 10: PLL Clock Source Select */
#define R_SYSTEM_PLL2CCR_PLL2MULNF_SHIFT (6)
#define R_SYSTEM_PLL2CCR_PLL2MULNF_MASK (0x3)
#  define R_SYSTEM_PLL2CCR_PLL2MULNF_V0_00_VALUE_AFTER_RESET (0 << R_SYSTEM_PLL2CCR_PLL2MULNF_SHIFT)  /* 0.00 (Value after reset) */
#  define R_SYSTEM_PLL2CCR_PLL2MULNF_V0_33_1_3 (1 << R_SYSTEM_PLL2CCR_PLL2MULNF_SHIFT)                /* 0.33 (1/3) */
#  define R_SYSTEM_PLL2CCR_PLL2MULNF_V0_66_2_3 (2 << R_SYSTEM_PLL2CCR_PLL2MULNF_SHIFT)                /* 0.66 (2/3) */
#  define R_SYSTEM_PLL2CCR_PLL2MULNF_V0_50_1_2 (3 << R_SYSTEM_PLL2CCR_PLL2MULNF_SHIFT)                /* 0.50 (1/2) */
#define R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT (8)
#define R_SYSTEM_PLL2CCR_PLL2MUL_MASK (0xff)
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V26_VALUE_AFTER_RESET (25 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)       /* ×26 (Value after reset) */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V27 (26 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                         /* ×27 */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V28 (27 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                         /* ×28 */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V89 (88 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                         /* ×89 */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V90 (89 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                         /* ×90 */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V91 (90 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                         /* ×91 */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V179 (178 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                       /* ×179 */
#  define R_SYSTEM_PLL2CCR_PLL2MUL_V180 (179 << R_SYSTEM_PLL2CCR_PLL2MUL_SHIFT)                       /* ×180 */

/* PLL2 Control Register (8-bits) *******************************************/

#define R_SYSTEM_PLL2CR_PLL2STP (1 <<  0)  /* 01: PLL2 Stop Control */

/* PLL Clock Control Register 2 (16-bits) ***********************************/

#define R_SYSTEM_PLLCCR2_PLODIVP_SHIFT (0)
#define R_SYSTEM_PLLCCR2_PLODIVP_MASK (0xf)
#  define R_SYSTEM_PLLCCR2_PLODIVP_V1 (0 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)              /* ×1 */
#  define R_SYSTEM_PLLCCR2_PLODIVP_V1_2 (1 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)            /* ×1 / 2 */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_2 (2 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_V1_4 (3 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)            /* ×1 / 4 */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_4 (4 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_V0101 (5 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)           /* ×1 / 6 (Value after reset) */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_6 (6 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_V1_8 (7 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)            /* ×1 / 8 */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_8 (8 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_9 (9 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_10 (10 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_11 (11 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_12 (12 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_13 (13 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_PROHIBITED_14 (14 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVP_V1_16 (15 << R_SYSTEM_PLLCCR2_PLODIVP_SHIFT)          /* ×1 / 16 */
#define R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT (4)
#define R_SYSTEM_PLLCCR2_PLODIVQ_MASK (0xf)
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_0 (0 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V1_2 (1 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)            /* ×1 / 2 */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V1_3 (2 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)            /* ×1 / 3 */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V1_4 (3 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)            /* ×1 / 4 */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V1_5 (4 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)            /* ×1 / 5 */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V0101 (5 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)           /* ×1 / 6 (Value after reset) */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_6 (6 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V1_8 (7 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)            /* ×1 / 8 */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_V1_9 (8 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)            /* ×1 / 9 */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_9 (9 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_10 (10 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_11 (11 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_12 (12 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_13 (13 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_14 (14 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVQ_PROHIBITED_15 (15 << R_SYSTEM_PLLCCR2_PLODIVQ_SHIFT)  /* prohibited */
#define R_SYSTEM_PLLCCR2_PLODIVR_SHIFT (8)
#define R_SYSTEM_PLLCCR2_PLODIVR_MASK (0xf)
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_0 (0 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V1_2 (1 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)            /* ×1 / 2 */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V1_3 (2 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)            /* ×1 / 3 */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V1_4 (3 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)            /* ×1 / 4 */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V1_5 (4 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)            /* ×1 / 5 */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V0101 (5 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)           /* ×1 / 6 (Value after reset) */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_6 (6 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V1_8 (7 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)            /* ×1 / 8 */
#  define R_SYSTEM_PLLCCR2_PLODIVR_V1_9 (8 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)            /* ×1 / 9 */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_9 (9 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_10 (10 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_11 (11 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_12 (12 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_13 (13 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_14 (14 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLLCCR2_PLODIVR_PROHIBITED_15 (15 << R_SYSTEM_PLLCCR2_PLODIVR_SHIFT)  /* prohibited */

/* PLL2 Clock Control Register 2 (16-bits) **********************************/

