apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT (0)
#define R_SYSTEM_PLL2CCR2_PL2ODIVP_MASK (0xf)
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_V1 (0 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)              /* ×1 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_V1_2 (1 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)            /* ×1 / 2 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_2 (2 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_V1_4 (3 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)            /* ×1 / 4 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_4 (4 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_V0101 (5 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)           /* ×1 / 6 (Value after reset) */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_6 (6 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_V1_8 (7 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)            /* ×1 / 8 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_8 (8 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_9 (9 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_10 (10 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_11 (11 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_12 (12 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_13 (13 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_PROHIBITED_14 (14 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVP_V1_16 (15 << R_SYSTEM_PLL2CCR2_PL2ODIVP_SHIFT)          /* ×1 / 16 */
#define R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT (4)
#define R_SYSTEM_PLL2CCR2_PL2ODIVQ_MASK (0xf)
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_0 (0 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V1_2 (1 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)            /* ×1 / 2 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V1_3 (2 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)            /* ×1 / 3 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V1_4 (3 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)            /* ×1 / 4 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V1_5 (4 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)            /* ×1 / 5 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V0101 (5 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)           /* ×1 / 6 (Value after reset) */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_6 (6 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V1_8 (7 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)            /* ×1 / 8 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_V1_9 (8 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)            /* ×1 / 9 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_9 (9 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_10 (10 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_11 (11 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_12 (12 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_13 (13 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_14 (14 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVQ_PROHIBITED_15 (15 << R_SYSTEM_PLL2CCR2_PL2ODIVQ_SHIFT)  /* prohibited */
#define R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT (8)
#define R_SYSTEM_PLL2CCR2_PL2ODIVR_MASK (0xf)
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_0 (0 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V1_2 (1 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)            /* ×1 / 2 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V1_3 (2 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)            /* ×1 / 3 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V1_4 (3 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)            /* ×1 / 4 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V1_5 (4 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)            /* ×1 / 5 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V0101 (5 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)           /* ×1 / 6 (Value after reset) */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_6 (6 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V1_8 (7 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)            /* ×1 / 8 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_V1_9 (8 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)            /* ×1 / 9 */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_9 (9 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)    /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_10 (10 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_11 (11 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_12 (12 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_13 (13 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_14 (14 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)  /* prohibited */
#  define R_SYSTEM_PLL2CCR2_PL2ODIVR_PROHIBITED_15 (15 << R_SYSTEM_PLL2CCR2_PL2ODIVR_SHIFT)  /* prohibited */

/* External Bus Clock Output Control Register (8-bits) **********************/

#define R_SYSTEM_EBCKOCR_EBCKOEN (1 <<  0)  /* 01: BCLK Pin Output Control */

/* SDRAM Clock Output Control Register (8-bits) *****************************/

#define R_SYSTEM_SDCKOCR_SDCKOEN (1 <<  0)  /* 01: SDCLK Pin Output Control */

/* SCI clock Division control register (8-bits) *****************************/

#define R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT (0)
#define R_SYSTEM_SCICKDIVCR_CKDIV_MASK (0x7)
#  define R_SYSTEM_SCICKDIVCR_CKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SCICKDIVCR_CKDIV_DIV_2 (1 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_SCICKDIVCR_CKDIV_DIV_4 (2 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_SCICKDIVCR_CKDIV_DIV_6 (3 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_SCICKDIVCR_CKDIV_DIV_8 (4 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_SCICKDIVCR_CKDIV_DIV_3 (5 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_SCICKDIVCR_CKDIV_DIV_5 (6 << R_SYSTEM_SCICKDIVCR_CKDIV_SHIFT)                 /* /5 */

