apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* SCI clock control register (8-bits) **************************************/

#define R_SYSTEM_SCICKCR_CKSEL_SHIFT (0)
#define R_SYSTEM_SCICKCR_CKSEL_MASK (0xf)
#  define R_SYSTEM_SCICKCR_CKSEL_HOCO (0 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_SCICKCR_CKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_SCICKCR_CKSEL_LOCO (2 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_SCICKCR_CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_SCICKCR_CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_SCICKCR_CKSEL_PLL1P (5 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_SCICKCR_CKSEL_PLL2P (6 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_SCICKCR_CKSEL_PLL1Q (7 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_SCICKCR_CKSEL_PLL1R (8 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_SCICKCR_CKSEL_PLL2Q (9 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_SCICKCR_CKSEL_PLL2R (10 << R_SYSTEM_SCICKCR_CKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_SCICKCR_CKSREQ (1 <<  6)                                                    /* 40: Clock Switching Request */
#define R_SYSTEM_SCICKCR_CKSRDY (1 <<  7)                                                    /* 80: Clock Switching Ready state flag */

/* SPI clock Division control register (8-bits) *****************************/

#define R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT (0)
#define R_SYSTEM_SPICKDIVCR_CKDIV_MASK (0x7)
#  define R_SYSTEM_SPICKDIVCR_CKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_SPICKDIVCR_CKDIV_DIV_2 (1 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_SPICKDIVCR_CKDIV_DIV_4 (2 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_SPICKDIVCR_CKDIV_DIV_6 (3 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_SPICKDIVCR_CKDIV_DIV_8 (4 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_SPICKDIVCR_CKDIV_DIV_3 (5 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_SPICKDIVCR_CKDIV_DIV_5 (6 << R_SYSTEM_SPICKDIVCR_CKDIV_SHIFT)                 /* /5 */

/* SPI clock control register (8-bits) **************************************/

#define R_SYSTEM_SPICKCR_CKSEL_SHIFT (0)
#define R_SYSTEM_SPICKCR_CKSEL_MASK (0xf)
#  define R_SYSTEM_SPICKCR_CKSEL_HOCO (0 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_SPICKCR_CKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_SPICKCR_CKSEL_LOCO (2 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_SPICKCR_CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_SPICKCR_CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_SPICKCR_CKSEL_PLL1P (5 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_SPICKCR_CKSEL_PLL2P (6 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_SPICKCR_CKSEL_PLL1Q (7 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_SPICKCR_CKSEL_PLL1R (8 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_SPICKCR_CKSEL_PLL2Q (9 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_SPICKCR_CKSEL_PLL2R (10 << R_SYSTEM_SPICKCR_CKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_SPICKCR_CKSREQ (1 <<  6)                                                    /* 40: Clock Switching Request */
#define R_SYSTEM_SPICKCR_CKSRDY (1 <<  7)                                                    /* 80: Clock Switching Ready state flag */

/* ADC clock Division control register (8-bits) *****************************/

#define R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT (0)
#define R_SYSTEM_ADCCKDIVCR_CKDIV_MASK (0x7)
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_DIV_2 (1 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_DIV_4 (2 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_DIV_6 (3 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_DIV_8 (4 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_DIV_3 (5 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_ADCCKDIVCR_CKDIV_DIV_5 (6 << R_SYSTEM_ADCCKDIVCR_CKDIV_SHIFT)                 /* /5 */

/* ADC clock control register (8-bits) **************************************/

#define R_SYSTEM_ADCCKCR_CKSEL_SHIFT (0)
#define R_SYSTEM_ADCCKCR_CKSEL_MASK (0xf)
#  define R_SYSTEM_ADCCKCR_CKSEL_HOCO (0 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_ADCCKCR_CKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_ADCCKCR_CKSEL_LOCO (2 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_ADCCKCR_CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_ADCCKCR_CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_ADCCKCR_CKSEL_PLL1P (5 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_ADCCKCR_CKSEL_PLL2P (6 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_ADCCKCR_CKSEL_PLL1Q (7 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_ADCCKCR_CKSEL_PLL1R (8 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_ADCCKCR_CKSEL_PLL2Q (9 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_ADCCKCR_CKSEL_PLL2R (10 << R_SYSTEM_ADCCKCR_CKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_ADCCKCR_CKSREQ (1 <<  6)                                                    /* 40: Clock Switching Request */
#define R_SYSTEM_ADCCKCR_CKSRDY (1 <<  7)                                                    /* 80: Clock Switching Ready state flag */

/* GPT clock Division control register (8-bits) *****************************/

#define R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT (0)
#define R_SYSTEM_GPTCKDIVCR_CKDIV_MASK (0x7)
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_DIV_2 (1 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_DIV_4 (2 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_DIV_6 (3 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_DIV_8 (4 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_DIV_3 (5 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_GPTCKDIVCR_CKDIV_DIV_5 (6 << R_SYSTEM_GPTCKDIVCR_CKDIV_SHIFT)                 /* /5 */

/* GPT clock control register (8-bits) **************************************/

#define R_SYSTEM_GPTCKCR_CKSEL_SHIFT (0)
#define R_SYSTEM_GPTCKCR_CKSEL_MASK (0xf)
#  define R_SYSTEM_GPTCKCR_CKSEL_HOCO (0 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_GPTCKCR_CKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_GPTCKCR_CKSEL_LOCO (2 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_GPTCKCR_CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_GPTCKCR_CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_GPTCKCR_CKSEL_PLL1P (5 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_GPTCKCR_CKSEL_PLL2P (6 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_GPTCKCR_CKSEL_PLL1Q (7 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_GPTCKCR_CKSEL_PLL1R (8 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_GPTCKCR_CKSEL_PLL2Q (9 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_GPTCKCR_CKSEL_PLL2R (10 << R_SYSTEM_GPTCKCR_CKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_GPTCKCR_CKSREQ (1 <<  6)                                                    /* 40: Clock Switching Request */
#define R_SYSTEM_GPTCKCR_CKSRDY (1 <<  7)                                                    /* 80: Clock Switching Ready state flag */

