apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* LCD clock Division control register (8-bits) *****************************/

#define R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT (0)
#define R_SYSTEM_LCDCKDIVCR_CKDIV_MASK (0x7)
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_DIV_2 (1 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_DIV_4 (2 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_DIV_6 (3 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_DIV_8 (4 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_DIV_3 (5 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_LCDCKDIVCR_CKDIV_DIV_5 (6 << R_SYSTEM_LCDCKDIVCR_CKDIV_SHIFT)                 /* /5 */

/* LCD clock control register (8-bits) **************************************/

#define R_SYSTEM_LCDCKCR_CKSEL_SHIFT (0)
#define R_SYSTEM_LCDCKCR_CKSEL_MASK (0xf)
#  define R_SYSTEM_LCDCKCR_CKSEL_HOCO (0 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_LCDCKCR_CKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_LCDCKCR_CKSEL_LOCO (2 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_LCDCKCR_CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_LCDCKCR_CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_LCDCKCR_CKSEL_PLL1P (5 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_LCDCKCR_CKSEL_PLL2P (6 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_LCDCKCR_CKSEL_PLL1Q (7 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_LCDCKCR_CKSEL_PLL1R (8 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_LCDCKCR_CKSEL_PLL2Q (9 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_LCDCKCR_CKSEL_PLL2R (10 << R_SYSTEM_LCDCKCR_CKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_LCDCKCR_CKSREQ (1 <<  6)                                                    /* 40: Clock Switching Request */
#define R_SYSTEM_LCDCKCR_CKSRDY (1 <<  7)                                                    /* 80: Clock Switching Ready state flag */

/* MOCO User Trimming Control Register (8-bits) *****************************/

#define R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT (0)
#define R_SYSTEM_MOCOUTCR_MOCOUTRM_MASK (0xff)
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_M128 (128 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)       /* -128 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_M127 (129 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)       /* -127 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_M126 (130 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)       /* -126 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_M1 (255 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)         /* -1 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_CENTER_CODE (0 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)  /* Center Code */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_P1 (1 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)           /* +1 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_P125 (125 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)       /* +125 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_P126 (126 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)       /* +126 */
#  define R_SYSTEM_MOCOUTCR_MOCOUTRM_P127 (127 << R_SYSTEM_MOCOUTCR_MOCOUTRM_SHIFT)       /* +127 */

/* HOCO User Trimming Control Register (8-bits) *****************************/

#define R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT (0)
#define R_SYSTEM_HOCOUTCR_HOCOUTRM_MASK (0xff)
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_M128 (128 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)       /* -128 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_M127 (129 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)       /* -127 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_M126 (130 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)       /* -126 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_M1 (255 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)         /* -1 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_CENTER_CODE (0 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)  /* Center Code */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_P1 (1 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)           /* +1 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_P125 (125 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)       /* +125 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_P126 (126 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)       /* +126 */
#  define R_SYSTEM_HOCOUTCR_HOCOUTRM_P127 (127 << R_SYSTEM_HOCOUTCR_HOCOUTRM_SHIFT)       /* +127 */

/* USB clock Division control register (8-bits) *****************************/

#define R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT (0)
#define R_SYSTEM_USBCKDIVCR_USBCKDIV_MASK (0x7)
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_DIV_2 (1 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_DIV_4 (2 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_DIV_6 (3 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_DIV_8 (4 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_DIV_3 (5 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_USBCKDIVCR_USBCKDIV_DIV_5 (6 << R_SYSTEM_USBCKDIVCR_USBCKDIV_SHIFT)                 /* /5 */

/* Octal-SPI clock Division control register (8-bits) ***********************/

#define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT (0)
#define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_MASK (0x7)
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_DIV_2 (1 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_DIV_4 (2 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_DIV_6 (3 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_DIV_8 (4 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_DIV_3 (5 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_OCTACKDIVCR_OCTACKDIV_DIV_5 (6 << R_SYSTEM_OCTACKDIVCR_OCTACKDIV_SHIFT)                 /* /5 */

/* CANFD Core clock Division control register (8-bits) **********************/

#define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT (0)
#define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_MASK (0x7)
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_DIV_2 (1 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_DIV_4 (2 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_DIV_6 (3 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_DIV_8 (4 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_DIV_3 (5 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_DIV_5 (6 << R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_SHIFT)                 /* /5 */

/* USB60 clock Division control register (8-bits) ***************************/

