apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT (0)
#define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_MASK (0x7)
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_DIV_2 (1 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_DIV_4 (2 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_DIV_6 (3 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_DIV_8 (4 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_DIV_3 (5 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_USB60CKDIVCR_USB60CKDIV_DIV_5 (6 << R_SYSTEM_USB60CKDIVCR_USB60CKDIV_SHIFT)                 /* /5 */

/* I3C clock Division control register (8-bits) *****************************/

#define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT (0)
#define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_MASK (0x7)
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_V1_VALUE_AFTER_RESET (0 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)  /* /1 (value after reset) */
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_DIV_2 (1 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)                 /* /2 */
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_DIV_4 (2 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)                 /* /4 */
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_DIV_6 (3 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)                 /* /6 */
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_DIV_8 (4 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)                 /* /8 */
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_DIV_3 (5 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)                 /* /3 */
#  define R_SYSTEM_I3CCKDIVCR_I3CCKDIV_DIV_5 (6 << R_SYSTEM_I3CCKDIVCR_I3CCKDIV_SHIFT)                 /* /5 */

/* USB clock control register (8-bits) **************************************/

#define R_SYSTEM_USBCKCR_USBCKSEL_SHIFT (0)
#define R_SYSTEM_USBCKCR_USBCKSEL_MASK (0xf)
#  define R_SYSTEM_USBCKCR_USBCKSEL_HOCO (0 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_USBCKCR_USBCKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_USBCKCR_USBCKSEL_LOCO (2 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_USBCKCR_USBCKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_USBCKCR_USBCKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_USBCKCR_USBCKSEL_PLL1P (5 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_USBCKCR_USBCKSEL_PLL2P (6 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_USBCKCR_USBCKSEL_PLL1Q (7 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_USBCKCR_USBCKSEL_PLL1R (8 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_USBCKCR_USBCKSEL_PLL2Q (9 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_USBCKCR_USBCKSEL_PLL2R (10 << R_SYSTEM_USBCKCR_USBCKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_USBCKCR_USBCKSREQ (1 <<  6)                                                       /* 40: USB clock (USBCLK) Switching Request */
#define R_SYSTEM_USBCKCR_USBCKSRDY (1 <<  7)                                                       /* 80: USB clock (USBCLK) Switching Ready state flag */

/* Octal-SPI clock control register (8-bits) ********************************/

#define R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT (0)
#define R_SYSTEM_OCTACKCR_OCTACKSEL_MASK (0xf)
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_HOCO (0 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_LOCO (2 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_PLL1P (5 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_PLL2P (6 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_PLL1Q (7 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_PLL1R (8 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_PLL2Q (9 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_OCTACKCR_OCTACKSEL_PLL2R (10 << R_SYSTEM_OCTACKCR_OCTACKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_OCTACKCR_OCTACKSREQ (1 <<  6)                                                         /* 40: Octal-SPI clock (OCTACLK) Switching Request */
#define R_SYSTEM_OCTACKCR_OCTACKSRDY (1 <<  7)                                                         /* 80: Octal-SPI clock (OCTACLK) Switching Ready state flag */

/* CANFD Core clock control register (8-bits) *******************************/

#define R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT (0)
#define R_SYSTEM_CANFDCKCR_CANFDCKSEL_MASK (0xf)
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_HOCO (0 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_LOCO (2 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_PLL1P (5 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_PLL2P (6 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_PLL1Q (7 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_PLL1R (8 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_PLL2Q (9 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_CANFDCKCR_CANFDCKSEL_PLL2R (10 << R_SYSTEM_CANFDCKCR_CANFDCKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_CANFDCKCR_CANFDCKSREQ (1 <<  6)                                                           /* 40: CANFD Core clock (CANFDCLK) Switching Request */
#define R_SYSTEM_CANFDCKCR_CANFDCKSRDY (1 <<  7)                                                           /* 80: CANFD Core clock (CANFDCLK) Switching Ready state flag */

/* USB60 clock control register (8-bits) ************************************/

#define R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT (0)
#define R_SYSTEM_USB60CKCR_USB60CKSEL_MASK (0xf)
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_HOCO (0 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_LOCO (2 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_PLL1P (5 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_PLL2P (6 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_PLL1Q (7 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_PLL1R (8 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_PLL2Q (9 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_USB60CKCR_USB60CKSEL_PLL2R (10 << R_SYSTEM_USB60CKCR_USB60CKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_USB60CKCR_USB60CKSREQ (1 <<  6)                                                           /* 40: USB clock (USB60CLK) Switching Request */
#define R_SYSTEM_USB60CKCR_USB60CKSRDY (1 <<  7)                                                           /* 80: USB clock (USB60CLK) Switching Ready state flag */

/* I3C clock control register (8-bits) **************************************/

#define R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT (0)
#define R_SYSTEM_I3CCKCR_I3CCKSEL_MASK (0xf)
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_HOCO (0 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                    /* HOCO */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_MOCO_VALUE_AFTER_RESET (1 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)  /* MOCO (value after reset) */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_LOCO (2 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                    /* LOCO */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_MAIN_CLOCK_OSCILLATOR (3 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)   /* Main clock oscillator */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_SUB_CLOCK_OSCILLATOR (4 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)    /* Sub-clock oscillator */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_PLL1P (5 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                   /* PLL1P */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_PLL2P (6 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                   /* PLL2P */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_PLL1Q (7 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                   /* PLL1Q */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_PLL1R (8 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                   /* PLL1R */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_PLL2Q (9 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                   /* PLL2Q */
#  define R_SYSTEM_I3CCKCR_I3CCKSEL_PLL2R (10 << R_SYSTEM_I3CCKCR_I3CCKSEL_SHIFT)                  /* PLL2R */
#define R_SYSTEM_I3CCKCR_I3CCKREQ (1 <<  6)                                                        /* 40: I3C clock (I3CCLK) Switching Request */
#define R_SYSTEM_I3CCKCR_I3CCKSRDY (1 <<  7)                                                       /* 80: I3C clock (I3CCLK) Switching Ready state flag */

/* Main Clock Oscillator Standby Control Register (8-bits) ******************/

#define R_SYSTEM_MOSCSCR_MOSCSOKP (1 <<  0)  /* 01: Main Clock Oscillator Standby Oscillation Keep select */

/* High-Speed On-Chip Oscillator Standby Control Register (8-bits) **********/

#define R_SYSTEM_HOCOSCR_HOCOSOKP (1 <<  0)  /* 01: HOCO Standby Oscillation Keep select */

/* Operating Power Control Register (8-bits) ********************************/

#define R_SYSTEM_OPCCR_OPCM_SHIFT (0)
#define R_SYSTEM_OPCCR_OPCM_MASK (0x3)
#  define R_SYSTEM_OPCCR_OPCM_HIGH_SPEED_MODE (0 << R_SYSTEM_OPCCR_OPCM_SHIFT)  /* High-speed mode */
#  define R_SYSTEM_OPCCR_OPCM_PROHIBITED_1 (1 << R_SYSTEM_OPCCR_OPCM_SHIFT)     /* Prohibited */
#  define R_SYSTEM_OPCCR_OPCM_PROHIBITED_2 (2 << R_SYSTEM_OPCCR_OPCM_SHIFT)     /* Prohibited */
#  define R_SYSTEM_OPCCR_OPCM_LOW_SPEED_MODE (3 << R_SYSTEM_OPCCR_OPCM_SHIFT)   /* Low-speed mode */
#define R_SYSTEM_OPCCR_OPCMTSF (1 <<  4)                                        /* 10: Operating Power Control Mode Transition Status Flag */

/* Main Clock Oscillator Wait Control Register (8-bits) *********************/

