apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_MOSCWTCR_MSTS_SHIFT (0)
#define R_SYSTEM_MOSCWTCR_MSTS_MASK (0xf)
#  define R_SYSTEM_MOSCWTCR_MSTS_V0000 (0 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 11.4us (3 cycles) / 15.3us (4 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0001 (1 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 133.5us (35 cycles) / 137.3us (36 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0010 (2 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 255.6us (67 cycles) / 259.4us (68 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0011 (3 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 499.7us (131 cycles) / 503.5us (132 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0100 (4 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 988.0us (259 cycles) / 991.8us (260 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0101 (5 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 2086.6us (547 cycles) (value after reset) / 2090.5us (548 cycles) (value after reset) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0110 (6 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 4039.8us (1059 cycles) / 4043.6us (1060 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V0111 (7 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 8190.2us (2147 cycles) / 8194.0us (2148 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V1000 (8 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 16368.9us (4291 cycles) / 16372.7us (4292 cycles) */
#  define R_SYSTEM_MOSCWTCR_MSTS_V1001 (9 << R_SYSTEM_MOSCWTCR_MSTS_SHIFT)  /* Wait time= 31139.4us (8163 cycles) / 31143.2us (8164 cycles) */

/* Reset Status Register 1 (32-bits) ****************************************/

#define R_SYSTEM_RSTSR1_IWDTRF (1 <<  0)  /* 01: Independent Watchdog Timer Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_WDT0RF (1 <<  1)  /* 02: Watchdog Timer0 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_SWRF (1 <<  2)    /* 04: Software Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_CLU0RF (1 <<  4)  /* 10: CPU0 Lockup Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_LM0RF (1 <<  5)   /* 20: Local memory 0 error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_BUSRF (1 << 10)   /* 400: Bus error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_CMRF (1 << 14)    /* 4000: Common memory error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_WDT1RF (1 << 17)  /* 20000: Watchdog Timer1 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_LM1RF (1 << 21)   /* 200000: Local memory 1 error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR1_NWRF (1 << 22)    /* 400000: Network Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */

/* System Register Access Control Register (8-bits) *************************/

#define R_SYSTEM_SYRACCR_BUSY (1 <<  0)  /* 01: Access Ready monitor */

/* Voltage Monitor %s Circuit Control Register 1 (8-bits) *******************/

#define R_SYSTEM_PVDCR1_SIZE 2
#define R_SYSTEM_PVDCR1_IDTSEL_SHIFT (0)
#define R_SYSTEM_PVDCR1_IDTSEL_MASK (0x3)
#  define R_SYSTEM_PVDCR1_IDTSEL_V00 (0 << R_SYSTEM_PVDCR1_IDTSEL_SHIFT)                  /* Generate when VCC>=Vdet (rise) is detected */
#  define R_SYSTEM_PVDCR1_IDTSEL_V01 (1 << R_SYSTEM_PVDCR1_IDTSEL_SHIFT)                  /* Generate when VCC<Vdet (fall) is detected */
#  define R_SYSTEM_PVDCR1_IDTSEL_V10 (2 << R_SYSTEM_PVDCR1_IDTSEL_SHIFT)                  /* Generate when fall and rise are detected */
#  define R_SYSTEM_PVDCR1_IDTSEL_SETTINGS_PROHIBITED (3 << R_SYSTEM_PVDCR1_IDTSEL_SHIFT)  /* Settings prohibited */
#define R_SYSTEM_PVDCR1_IRQSEL (1 <<  2)                                                  /* 04: Voltage Monitor Interrupt Type Select */

/* Voltage Monitor %s Circuit Status Register (8-bits) **********************/

#define R_SYSTEM_PVDSR_SIZE 2
#define R_SYSTEM_PVDSR_DET (1 <<  0)  /* 01: Voltage Monitor Voltage Change Detection Flag NOTE: Only 0 can be written to this bit. After writing 0 to this bit, it takes 2 system clock cycles for the bit to be read as 0. */
#define R_SYSTEM_PVDSR_MON (1 <<  1)  /* 02: Voltage Monitor Signal Monitor Flag */

/* Clock Recovery System Control Register (8-bits) **************************/

#define R_SYSTEM_CRVSYSCR_CRVEN (1 <<  0)  /* 01: Clock Recovery Enable */

/* Graphics Power Domain Control Register (8-bits) **************************/

#define R_SYSTEM_PDCTRGD_PDDE (1 <<  0)    /* 01: Power control enable */
#define R_SYSTEM_PDCTRGD_PDCSF (1 <<  6)   /* 40: Power control status flag */
#define R_SYSTEM_PDCTRGD_PDPGSF (1 <<  7)  /* 80: Power gating status flag */

/* VBATT Backup Register Security Attribute Boundary Address Register
 * (16-bits)
 */

#define R_SYSTEM_VBRSABAR_SABA_SHIFT (0)
#define R_SYSTEM_VBRSABAR_SABA_MASK (0xffff)

/* VBATT Backup Register Privilege Attribute Boundary Address Register for
 * Secure Region (16-bits)
 */

#define R_SYSTEM_VBRPABARS_PABAS_SHIFT (0)
#define R_SYSTEM_VBRPABARS_PABAS_MASK (0xffff)

/* VBATT Backup Register Privilege Attribute Boundary Address Register for
 * Non-secure Region (16-bits)
 */

#define R_SYSTEM_VBRPABARNS_PABANS_SHIFT (0)
#define R_SYSTEM_VBRPABARNS_PABANS_MASK (0xffff)

/* Clock Generation Function Security Attribute Register (32-bits) **********/

#define R_SYSTEM_CGFSAR_NONSEC00 (1 <<  0)  /* 01: Non-secure Attribute bit 0 */
#define R_SYSTEM_CGFSAR_NONSEC02 (1 <<  2)  /* 04: Non-secure Attribute bit 2 */
#define R_SYSTEM_CGFSAR_NONSEC03 (1 <<  3)  /* 08: Non-secure Attribute bit 3 */
#define R_SYSTEM_CGFSAR_NONSEC04 (1 <<  4)  /* 10: Non-secure Attribute bit 4 */
#define R_SYSTEM_CGFSAR_NONSEC05 (1 <<  5)  /* 20: Non-secure Attribute bit 5 */
#define R_SYSTEM_CGFSAR_NONSEC06 (1 <<  6)  /* 40: Non-secure Attribute bit 6 */
#define R_SYSTEM_CGFSAR_NONSEC07 (1 <<  7)  /* 80: Non-secure Attribute bit 7 */
#define R_SYSTEM_CGFSAR_NONSEC08 (1 <<  8)  /* 100: Non-secure Attribute bit 8 */
#define R_SYSTEM_CGFSAR_NONSEC09 (1 <<  9)  /* 200: Non-secure Attribute bit 9 */
#define R_SYSTEM_CGFSAR_NONSEC11 (1 << 11)  /* 800: Non-secure Attribute bit 11 */
#define R_SYSTEM_CGFSAR_NONSEC12 (1 << 12)  /* 1000: Non-secure Attribute bit 12 */
#define R_SYSTEM_CGFSAR_NONSEC13 (1 << 13)  /* 2000: Non-secure Attribute bit 13 */
#define R_SYSTEM_CGFSAR_NONSEC16 (1 << 16)  /* 10000: Non-secure Attribute bit 16 */
#define R_SYSTEM_CGFSAR_NONSEC17 (1 << 17)  /* 20000: Non-secure Attribute bit 17 */
#define R_SYSTEM_CGFSAR_NONSEC18 (1 << 18)  /* 40000: Non-secure Attribute bit 18 */
#define R_SYSTEM_CGFSAR_NONSEC19 (1 << 19)  /* 80000: Non-secure Attribute bit 19 */
#define R_SYSTEM_CGFSAR_NONSEC20 (1 << 20)  /* 100000: Non-secure Attribute bit 20 */
#define R_SYSTEM_CGFSAR_NONSEC21 (1 << 21)  /* 200000: Non-secure Attribute bit 21 */
#define R_SYSTEM_CGFSAR_NONSEC22 (1 << 22)  /* 400000: Non-secure Attribute bit 22 */
#define R_SYSTEM_CGFSAR_NONSEC24 (1 << 24)  /* 1000000: Non-secure Attribute bit 24 */
#define R_SYSTEM_CGFSAR_NONSEC25 (1 << 25)  /* 2000000: Non-secure Attribute bit 25 */
#define R_SYSTEM_CGFSAR_NONSEC26 (1 << 26)  /* 4000000: Non-secure Attribute bit 26 */

/* Reset Security Attribution Register (32-bits) ****************************/

#define R_SYSTEM_RSTSAR_NONSEC0 (1 <<  0)  /* 01: Non-secure Attribute bit 0 */
#define R_SYSTEM_RSTSAR_NONSEC1 (1 <<  1)  /* 02: Non-secure Attribute bit 1 */
#define R_SYSTEM_RSTSAR_NONSEC2 (1 <<  2)  /* 04: Non-secure Attribute bit 2 */
#define R_SYSTEM_RSTSAR_NONSEC3 (1 <<  3)  /* 08: Non-secure Attribute bit 3 */

/* Low Power Mode Security Attribution Register (32-bits) *******************/

#define R_SYSTEM_LPMSAR_NONSEC0 (1 <<  0)   /* 01: Non-secure Attribute bit 00 */
#define R_SYSTEM_LPMSAR_NONSEC1 (1 <<  1)   /* 02: Non-secure Attribute bit 01 */
#define R_SYSTEM_LPMSAR_NONSEC2 (1 <<  2)   /* 04: Non-secure Attribute bit 02 */
#define R_SYSTEM_LPMSAR_NONSEC3 (1 <<  3)   /* 08: Non-secure Attribute bit 03 */
#define R_SYSTEM_LPMSAR_NONSEC8 (1 <<  8)   /* 100: Non-secure Attribute bit 08 */
#define R_SYSTEM_LPMSAR_NONSEC16 (1 << 16)  /* 10000: Non-secure Attribute bit 16 */
#define R_SYSTEM_LPMSAR_NONSEC17 (1 << 17)  /* 20000: Non-secure Attribute bit 17 */
#define R_SYSTEM_LPMSAR_NONSEC18 (1 << 18)  /* 40000: Non-secure Attribute bit 18 */
#define R_SYSTEM_LPMSAR_NONSEC19 (1 << 19)  /* 80000: Non-secure Attribute bit 19 */
#define R_SYSTEM_LPMSAR_NONSEC21 (1 << 21)  /* 200000: Non-secure Attribute bit 21 */

/* Programmable Voltage Detection Security Attribution Register (32-bits) ***/

#define R_SYSTEM_PVDSAR_NONSEC0 (1 <<  0)  /* 01: Non-secure Attribute bit 0 */
#define R_SYSTEM_PVDSAR_NONSEC1 (1 <<  1)  /* 02: Non-secure Attribute bit 1 */

/* Battery Backup Function Security Attribute Register (32-bits) ************/

#define R_SYSTEM_BBFSAR_NONSEC0 (1 <<  0)  /* 01: Non-secure Attribute bit 0 */
#define R_SYSTEM_BBFSAR_NONSEC1 (1 <<  1)  /* 02: Non-secure Attribute bit 1 */
#define R_SYSTEM_BBFSAR_NONSEC2 (1 <<  2)  /* 04: Non-secure Attribute bit 2 */
#define R_SYSTEM_BBFSAR_NONSEC3 (1 <<  3)  /* 08: Non-secure Attribute bit 3 */
#define R_SYSTEM_BBFSAR_NONSEC4 (1 <<  4)  /* 10: Non-secure Attribute bit 4 */

/* Power Gating Control Security Attribution Register (32-bits) *************/

#define R_SYSTEM_PGCSAR_NONSEC1 (1 <<  1)  /* 02: Non-secure Attribute bit 01 */
#define R_SYSTEM_PGCSAR_NONSEC2 (1 <<  2)  /* 04: Non-secure Attribute bit 02 */

/* Deep Standby Interrupt Factor Security Attribution Register (32-bits) ****/

#define R_SYSTEM_DPFSAR_DPFSA16 (1 << 16)  /* 10000: Deep Standby Interrupt Factor Security Attribute bit 16 */
#define R_SYSTEM_DPFSAR_DPFSA17 (1 << 17)  /* 20000: Deep Standby Interrupt Factor Security Attribute bit 17 */
#define R_SYSTEM_DPFSAR_DPFSA18 (1 << 18)  /* 40000: Deep Standby Interrupt Factor Security Attribute bit 18 */
#define R_SYSTEM_DPFSAR_DPFSA19 (1 << 19)  /* 80000: Deep Standby Interrupt Factor Security Attribute bit 19 */
#define R_SYSTEM_DPFSAR_DPFSA20 (1 << 20)  /* 100000: Deep Standby Interrupt Factor Security Attribute bit 20 */
#define R_SYSTEM_DPFSAR_DPFSA24 (1 << 24)  /* 1000000: Deep Standby Interrupt Factor Security Attribute bit 24 */
#define R_SYSTEM_DPFSAR_DPFSA25 (1 << 25)  /* 2000000: Deep Standby Interrupt Factor Security Attribute bit 25 */
#define R_SYSTEM_DPFSAR_DPFSA26 (1 << 26)  /* 4000000: Deep Standby Interrupt Factor Security Attribute bit 26 */
#define R_SYSTEM_DPFSAR_DPFSA27 (1 << 27)  /* 8000000: Deep Standby Interrupt Factor Security Attribute bit 27 */
#define R_SYSTEM_DPFSAR_DPFSA29 (1 << 29)  /* 20000000: Deep Standby Interrupt Factor Security Attribute bit 29 */
#define R_SYSTEM_DPFSAR_DPFSA31 (1 << 31)  /* 80000000: Deep Standby Interrupt Factor Security Attribute bit 31 */

