apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* RAM Standby Control Security Attribution Register (32-bits) **************/

#define R_SYSTEM_RSCSAR_RSCSA0 (1 <<  0)   /* 01: RAM Standby Control Security Attribute bit 00 */
#define R_SYSTEM_RSCSAR_RSCSA1 (1 <<  1)   /* 02: RAM Standby Control Security Attribute bit 01 */
#define R_SYSTEM_RSCSAR_RSCSA2 (1 <<  2)   /* 04: RAM Standby Control Security Attribute bit 02 */
#define R_SYSTEM_RSCSAR_RSCSA3 (1 <<  3)   /* 08: RAM Standby Control Security Attribute bit 03 */
#define R_SYSTEM_RSCSAR_RSCSA4 (1 <<  4)   /* 10: RAM Standby Control Security Attribute bit 04 */
#define R_SYSTEM_RSCSAR_RSCSA5 (1 <<  5)   /* 20: RAM Standby Control Security Attribute bit 05 */
#define R_SYSTEM_RSCSAR_RSCSA6 (1 <<  6)   /* 40: RAM Standby Control Security Attribute bit 06 */
#define R_SYSTEM_RSCSAR_RSCSA7 (1 <<  7)   /* 80: RAM Standby Control Security Attribute bit 07 */
#define R_SYSTEM_RSCSAR_RSCSA8 (1 <<  8)   /* 100: RAM Standby Control Security Attribute bit 08 */
#define R_SYSTEM_RSCSAR_RSCSA9 (1 <<  9)   /* 200: RAM Standby Control Security Attribute bit 09 */
#define R_SYSTEM_RSCSAR_RSCSA10 (1 << 10)  /* 400: RAM Standby Control Security Attribute bit 10 */
#define R_SYSTEM_RSCSAR_RSCSA11 (1 << 11)  /* 800: RAM Standby Control Security Attribute bit 11 */
#define R_SYSTEM_RSCSAR_RSCSA12 (1 << 12)  /* 1000: RAM Standby Control Security Attribute bit 12 */
#define R_SYSTEM_RSCSAR_RSCSA13 (1 << 13)  /* 2000: RAM Standby Control Security Attribute bit 13 */
#define R_SYSTEM_RSCSAR_RSCSA14 (1 << 14)  /* 4000: RAM Standby Control Security Attribute bit 14 */
#define R_SYSTEM_RSCSAR_RSCSA16 (1 << 16)  /* 10000: RAM Standby Control Security Attribute bit 16 */
#define R_SYSTEM_RSCSAR_RSCSA17 (1 << 17)  /* 20000: RAM Standby Control Security Attribute bit 17 */

/* Protect Register for Secure Register (16-bits) ***************************/

#define R_SYSTEM_PRCR_S_PRC0 (1 <<  0)                                      /* 01: Enables writing to the registers related to the clock generation circuit. */
#define R_SYSTEM_PRCR_S_PRC1 (1 <<  1)                                      /* 02: Enables writing to the registers related to the operating modes, the low power modes, and the battery backup function. */
#define R_SYSTEM_PRCR_S_PRC3 (1 <<  3)                                      /* 08: Enables writing to the registers related to the PVD. */
#define R_SYSTEM_PRCR_S_PRC4 (1 <<  4)                                      /* 10: Enables writing to the registers related to the security and privilege setting registers. */
#define R_SYSTEM_PRCR_S_PRC5 (1 <<  5)                                      /* 20: Enables writing to the registers related the reset control. */
#define R_SYSTEM_PRCR_S_PRKEY_SHIFT (8)
#define R_SYSTEM_PRCR_S_PRKEY_MASK (0xff)
#  define R_SYSTEM_PRCR_S_PRKEY_V0XA5 (165 << R_SYSTEM_PRCR_S_PRKEY_SHIFT)  /* Enables writing to the PRCR_S register. */

/* Protect Register for Non-secure Register (16-bits) ***********************/

#define R_SYSTEM_PRCR_NS_PRC0 (1 <<  0)                                       /* 01: Enables writing to the registers related to the clock generation circuit. */
#define R_SYSTEM_PRCR_NS_PRC1 (1 <<  1)                                       /* 02: Enables writing to the registers related to the operating modes, the low power modes, and the battery backup function. */
#define R_SYSTEM_PRCR_NS_PRC3 (1 <<  3)                                       /* 08: Enables writing to the registers related to the PVD. */
#define R_SYSTEM_PRCR_NS_PRC4 (1 <<  4)                                       /* 10: Enables writing to the registers related to the privilege setting registers. */
#define R_SYSTEM_PRCR_NS_PRKEY_SHIFT (8)
#define R_SYSTEM_PRCR_NS_PRKEY_MASK (0xff)
#  define R_SYSTEM_PRCR_NS_PRKEY_V0XA5 (165 << R_SYSTEM_PRCR_NS_PRKEY_SHIFT)  /* Enables writing to the PRCR_NS register. */

/* Low-Speed On-Chip Oscillator Control Register (8-bits) *******************/

#define R_SYSTEM_LOCOCR_LCSTP (1 <<  0)  /* 01: LOCO Stop */

/* LOCO User Trimming Control Register (8-bits) *****************************/

#define R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT (0)
#define R_SYSTEM_LOCOUTCR_LOCOUTRM_MASK (0xff)
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_M128 (128 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)       /* -128 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_M127 (129 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)       /* -127 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_M126 (130 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)       /* -126 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_M1 (255 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)         /* -1 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_CENTER_CODE (0 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)  /* Center Code */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_P1 (1 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)           /* +1 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_P125 (125 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)       /* +125 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_P126 (126 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)       /* +126 */
#  define R_SYSTEM_LOCOUTCR_LOCOUTRM_P127 (127 << R_SYSTEM_LOCOUTCR_LOCOUTRM_SHIFT)       /* +127 */

/* Deep Standby Control Register (8-bits) ***********************************/

#define R_SYSTEM_DPSBYCR_DCSSMODE (1 <<  2)  /* 04: DCDC SSMODE */
#define R_SYSTEM_DPSBYCR_SRKEEP (1 <<  4)    /* 10: Standby RAM Retention */
#define R_SYSTEM_DPSBYCR_IOKEEP (1 <<  6)    /* 40: I/O Port Retention */

/* Deep Standby Wait Control Register (8-bits) ******************************/

#define R_SYSTEM_DPSWCR_WTSTS_SHIFT (0)
#define R_SYSTEM_DPSWCR_WTSTS_MASK (0xff)
#  define R_SYSTEM_DPSWCR_WTSTS_V0X0B (11 << R_SYSTEM_DPSWCR_WTSTS_SHIFT)   /* Wait cycle for fast recovery */
#  define R_SYSTEM_DPSWCR_WTSTS_V0X9A (154 << R_SYSTEM_DPSWCR_WTSTS_SHIFT)  /* Wait cycle for slow recovery */

/* Deep Standby Interrupt Enable Register 0 (8-bits) ************************/

#define R_SYSTEM_DPSIER0_DIRQ0E (1 <<  0)  /* 01: IRQ0-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ1E (1 <<  1)  /* 02: IRQ1-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ2E (1 <<  2)  /* 04: IRQ2-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ3E (1 <<  3)  /* 08: IRQ3-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ4E (1 <<  4)  /* 10: IRQ4-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ5E (1 <<  5)  /* 20: IRQ5-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ6E (1 <<  6)  /* 40: IRQ6-DS Pin Enable */
#define R_SYSTEM_DPSIER0_DIRQ7E (1 <<  7)  /* 80: IRQ7-DS Pin Enable */

/* Deep Standby Interrupt Enable Register 1 (8-bits) ************************/

#define R_SYSTEM_DPSIER1_DIRQ8E (1 <<  0)   /* 01: IRQ8-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ9E (1 <<  1)   /* 02: IRQ9-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ10E (1 <<  2)  /* 04: IRQ10-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ11E (1 <<  3)  /* 08: IRQ11-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ12E (1 <<  4)  /* 10: IRQ12-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ13E (1 <<  5)  /* 20: IRQ13-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ14E (1 <<  6)  /* 40: IRQ14-DS Pin Enable */
#define R_SYSTEM_DPSIER1_DIRQ15E (1 <<  7)  /* 80: IRQ15-DS Pin Enable */

/* Deep Standby Interrupt Enable Register 2 (8-bits) ************************/

