apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_DPSIER2_DPVD1IE (1 <<  0)   /* 01: PVD1 Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER2_DPVD2IE (1 <<  1)   /* 02: PVD2 Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER2_DTRTCIIE (1 <<  2)  /* 04: RTC Interval interrupt Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER2_DRTCAIE (1 <<  3)   /* 08: RTC Alarm interrupt Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER2_DNMIE (1 <<  4)     /* 10: NMI Pin Enable */

/* Deep Standby Interrupt Enable Register 3 (8-bits) ************************/

#define R_SYSTEM_DPSIER3_DUSBFSIE (1 <<  0)    /* 01: USBFS Suspend/Resume Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER3_DUSBHSIE (1 <<  1)    /* 02: USBHS Suspend/Resume Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER3_DULPT0IE (1 <<  2)    /* 04: ULPT0 Overflow Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER3_DULPT1IE (1 <<  3)    /* 08: ULPT1 Overflow Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER3_DIWDTIE (1 <<  5)     /* 20: IWDT Overflow Deep Standby Cancel Signal Enable */
#define R_SYSTEM_DPSIER3_DVBATTADIE (1 <<  7)  /* 80: VBATT Tamper Detection Deep Standby Cancel Signal Enable */

/* Deep Standby Interrupt Flag Register 0 (8-bits) **************************/

#define R_SYSTEM_DPSIFR0_DIRQ0F (1 <<  0)  /* 01: IRQ0-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ1F (1 <<  1)  /* 02: IRQ1-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ2F (1 <<  2)  /* 04: IRQ2-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ3F (1 <<  3)  /* 08: IRQ3-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ4F (1 <<  4)  /* 10: IRQ4-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ5F (1 <<  5)  /* 20: IRQ5-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ6F (1 <<  6)  /* 40: IRQ6-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR0_DIRQ7F (1 <<  7)  /* 80: IRQ7-DS Pin Deep Standby Cancel Flag */

/* Deep Standby Interrupt Flag Register 1 (8-bits) **************************/

#define R_SYSTEM_DPSIFR1_DIRQ8F (1 <<  0)   /* 01: IRQ8-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ9F (1 <<  1)   /* 02: IRQ9-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ10F (1 <<  2)  /* 04: IRQ10-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ11F (1 <<  3)  /* 08: IRQ11-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ12F (1 <<  4)  /* 10: IRQ12-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ13F (1 <<  5)  /* 20: IRQ13-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ14F (1 <<  6)  /* 40: IRQ14-DS Pin Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR1_DIRQ15F (1 <<  7)  /* 80: IRQ15-DS Pin Deep Standby Cancel Flag */

/* Deep Standby Interrupt Flag Register 2 (8-bits) **************************/

#define R_SYSTEM_DPSIFR2_DPVD1IF (1 <<  0)   /* 01: PVD1 Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR2_DPVD2IF (1 <<  1)   /* 02: PVD2 Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR2_DTRTCIIF (1 <<  2)  /* 04: RTC Interval interrupt Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR2_DRTCAIF (1 <<  3)   /* 08: RTC Alarm interrupt Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR2_DNMIF (1 <<  4)     /* 10: NMI Pin Deep Standby Cancel Flag */

/* Deep Standby Interrupt Flag Register 3 (8-bits) **************************/

#define R_SYSTEM_DPSIFR3_DUSBFSIF (1 <<  0)    /* 01: USBFS Suspend/Resume Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR3_DUSBHSIF (1 <<  1)    /* 02: USBHS Suspend/Resume Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR3_DULPT0IF (1 <<  2)    /* 04: ULPT0 Overflow Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR3_DULPT1IF (1 <<  3)    /* 08: ULPT1 Overflow Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR3_DIWDTIF (1 <<  5)     /* 20: IWDT Overflow Deep Standby Cancel Flag */
#define R_SYSTEM_DPSIFR3_DVBATTADIF (1 <<  7)  /* 80: VBATT Tamper Detection Deep Standby Cancel Flag */

/* Deep Standby Interrupt Edge Register 0 (8-bits) **************************/

#define R_SYSTEM_DPSIEGR0_DIRQ0EG (1 <<  0)  /* 01: IRQ0-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ1EG (1 <<  1)  /* 02: IRQ1-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ2EG (1 <<  2)  /* 04: IRQ2-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ3EG (1 <<  3)  /* 08: IRQ3-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ4EG (1 <<  4)  /* 10: IRQ4-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ5EG (1 <<  5)  /* 20: IRQ5-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ6EG (1 <<  6)  /* 40: IRQ6-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR0_DIRQ7EG (1 <<  7)  /* 80: IRQ7-DS Pin Edge Select */

/* Deep Standby Interrupt Edge Register 1 (8-bits) **************************/

#define R_SYSTEM_DPSIEGR1_DIRQ8EG (1 <<  0)   /* 01: IRQ8-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ9EG (1 <<  1)   /* 02: IRQ9-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ10EG (1 <<  2)  /* 04: IRQ10-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ11EG (1 <<  3)  /* 08: IRQ11-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ12EG (1 <<  4)  /* 10: IRQ12-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ13EG (1 <<  5)  /* 20: IRQ13-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ14EG (1 <<  6)  /* 40: IRQ14-DS Pin Edge Select */
#define R_SYSTEM_DPSIEGR1_DIRQ15EG (1 <<  7)  /* 80: IRQ15-DS Pin Edge Select */

/* Deep Standby Interrupt Edge Register 2 (8-bits) **************************/

#define R_SYSTEM_DPSIEGR2_DPVD1EG (1 <<  0)  /* 01: PVD1 Edge Select */
#define R_SYSTEM_DPSIEGR2_DPVD2EG (1 <<  1)  /* 02: PVD2 Edge Select */
#define R_SYSTEM_DPSIEGR2_DNMIEG (1 <<  4)   /* 10: NMI Pin Edge Select */

/* System Control OCD Control Register (8-bits) *****************************/

#define R_SYSTEM_SYOCDCR_DOCDF (1 <<  0)  /* 01: Deep Standby OCD flag */
#define R_SYSTEM_SYOCDCR_DBGEN (1 <<  7)  /* 80: Debugger Enable bit */

/* Reset Status Register 0 (8-bits) *****************************************/

#define R_SYSTEM_RSTSR0_PORF (1 <<  0)     /* 01: Power-On Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_PVD0RF (1 <<  1)   /* 02: Voltage Monitor 0 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_PVD1RF (1 <<  2)   /* 04: Voltage Monitor 1 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_PVD2RF (1 <<  3)   /* 08: Voltage Monitor 2 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_PVD3RF (1 <<  4)   /* 10: Voltage Monitor 3 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_PVD4RF (1 <<  5)   /* 20: Voltage Monitor 4 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_PVD5RF (1 <<  6)   /* 40: Voltage Monitor 5 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */
#define R_SYSTEM_RSTSR0_DPSRSTF (1 <<  7)  /* 80: Deep Software Standby Reset FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0. */

