apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* Reset Status Register 2 (8-bits) *****************************************/

#define R_SYSTEM_RSTSR2_CWSF (1 <<  0)  /* 01: Cold/Warm Start Determination Flag */

/* Reset Status Register 3 (8-bits) *****************************************/

#define R_SYSTEM_RSTSR3_OCPRF (1 <<  4)  /* 10: Overcurrent protection reset Detect Flag */

/* Main Clock Oscillator Mode Oscillation Control Register (8-bits) *********/

#define R_SYSTEM_MOMCR_MODRV0_SHIFT (1)
#define R_SYSTEM_MOMCR_MODRV0_MASK (0x7)
#  define R_SYSTEM_MOMCR_MODRV0_V8MHZ (0 << R_SYSTEM_MOMCR_MODRV0_SHIFT)              /* 8MHz */
#  define R_SYSTEM_MOMCR_MODRV0_V8_1MHZ_TO_16MHZ (1 << R_SYSTEM_MOMCR_MODRV0_SHIFT)   /* 8.1MHz to 16MHz */
#  define R_SYSTEM_MOMCR_MODRV0_V16_1MHZ_TO_20MHZ (2 << R_SYSTEM_MOMCR_MODRV0_SHIFT)  /* 16.1MHz to 20MHz */
#  define R_SYSTEM_MOMCR_MODRV0_V20_1MHZ_TO_26MHZ (3 << R_SYSTEM_MOMCR_MODRV0_SHIFT)  /* 20.1MHz to 26MHz */
#  define R_SYSTEM_MOMCR_MODRV0_V48MHZ_4 (4 << R_SYSTEM_MOMCR_MODRV0_SHIFT)           /* 48MHz */
#  define R_SYSTEM_MOMCR_MODRV0_V101 (5 << R_SYSTEM_MOMCR_MODRV0_SHIFT)               /* 48MHz (value after reset) */
#  define R_SYSTEM_MOMCR_MODRV0_V48MHZ_6 (6 << R_SYSTEM_MOMCR_MODRV0_SHIFT)           /* 48MHz */
#  define R_SYSTEM_MOMCR_MODRV0_V48MHZ_7 (7 << R_SYSTEM_MOMCR_MODRV0_SHIFT)           /* 48MHz */
#define R_SYSTEM_MOMCR_AGCEN (1 <<  4)                                                /* 10: Auto Gain Control Enable */
#define R_SYSTEM_MOMCR_MOSEL (1 <<  6)                                                /* 40: Main Clock Oscillator Switching */

/* Flash Write Erase Protect Register (8-bits) ******************************/

#define R_SYSTEM_FWEPROR_FLWE_SHIFT (0)
#define R_SYSTEM_FWEPROR_FLWE_MASK (0x3)
#  define R_SYSTEM_FWEPROR_FLWE_V00 (0 << R_SYSTEM_FWEPROR_FLWE_SHIFT)  /* Prohibits programming and erasure of the code flash, data flash or blank checking. */
#  define R_SYSTEM_FWEPROR_FLWE_V01 (1 << R_SYSTEM_FWEPROR_FLWE_SHIFT)  /* Permits programming and erasure of the code flash, data flash or blank checking. */
#  define R_SYSTEM_FWEPROR_FLWE_V10 (2 << R_SYSTEM_FWEPROR_FLWE_SHIFT)  /* Prohibits programming and erasure of the code flash, data flash or blank checking. */
#  define R_SYSTEM_FWEPROR_FLWE_V11 (3 << R_SYSTEM_FWEPROR_FLWE_SHIFT)  /* Prohibits programming and erasure of the code flash, data flash or blank checking. */

/* Voltage Monitor 1 Comparator Control Register (8-bits) *******************/

#define R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT (0)
#define R_SYSTEM_PVD1CMPCR_PVDLVL_MASK (0x1f)
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V4_29V_VDETM_0 (0 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 4.29V (Vdetm_0) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V4_16V_VDETM_1 (1 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 4.16V (Vdetm_1) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V4_03V_VDETM_2 (2 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 4.03V (Vdetm_2) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V3_86V_VDETM_3 (3 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 3.86V (Vdetm_3) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V3_14V_VDETM_4 (4 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 3.14V (Vdetm_4) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V3_10V_VDETM_5 (5 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 3.10V (Vdetm_5) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V3_08V_VDETM_6 (6 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 3.08V (Vdetm_6) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V2_85V_VDETM_7 (7 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 2.85V (Vdetm_7) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V2_83V_VDETM_8 (8 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 2.83V (Vdetm_8) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V2_80V_VDETM_9 (9 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)    /* 2.80V (Vdetm_9) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V2_62V_VDETM_10 (10 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)  /* 2.62V (Vdetm_10) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V2_33V_VDETM_11 (11 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)  /* 2.33V (Vdetm_11) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V1_90V_VDETM_12 (12 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)  /* 1.90V (Vdetm_12) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V1_86V_VDETM_13 (13 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)  /* 1.86V (Vdetm_13) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V1_74V_VDETM_14 (14 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)  /* 1.74V (Vdetm_14) */
#  define R_SYSTEM_PVD1CMPCR_PVDLVL_V1_71V_VDETM_15 (15 << R_SYSTEM_PVD1CMPCR_PVDLVL_SHIFT)  /* 1.71V (Vdetm_15) */
#define R_SYSTEM_PVD1CMPCR_PVDE (1 <<  7)                                                    /* 80: Voltage Detection 1 Enable */

/* Voltage Monitor 2 Comparator Control Register (8-bits) *******************/

#define R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT (0)
#define R_SYSTEM_PVD2CMPCR_PVDLVL_MASK (0x1f)
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V4_29V_VDETM_0 (0 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 4.29V (Vdetm_0) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V4_16V_VDETM_1 (1 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 4.16V (Vdetm_1) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V4_03V_VDETM_2 (2 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 4.03V (Vdetm_2) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V3_86V_VDETM_3 (3 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 3.86V (Vdetm_3) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V3_14V_VDETM_4 (4 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 3.14V (Vdetm_4) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V3_10V_VDETM_5 (5 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 3.10V (Vdetm_5) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V3_08V_VDETM_6 (6 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 3.08V (Vdetm_6) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V2_85V_VDETM_7 (7 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 2.85V (Vdetm_7) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V2_83V_VDETM_8 (8 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 2.83V (Vdetm_8) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V2_80V_VDETM_9 (9 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)    /* 2.80V (Vdetm_9) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V2_62V_VDETM_10 (10 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)  /* 2.62V (Vdetm_10) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V2_33V_VDETM_11 (11 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)  /* 2.33V (Vdetm_11) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V1_90V_VDETM_12 (12 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)  /* 1.90V (Vdetm_12) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V1_86V_VDETM_13 (13 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)  /* 1.86V (Vdetm_13) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V1_74V_VDETM_14 (14 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)  /* 1.74V (Vdetm_14) */
#  define R_SYSTEM_PVD2CMPCR_PVDLVL_V1_71V_VDETM_15 (15 << R_SYSTEM_PVD2CMPCR_PVDLVL_SHIFT)  /* 1.71V (Vdetm_15) */
#define R_SYSTEM_PVD2CMPCR_PVDE (1 <<  7)                                                    /* 80: Voltage Detection 2 Enable */

