apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
/* Voltage Monitor %s Circuit Control Register 0 (8-bits) *******************/

#define R_SYSTEM_PVDCR0_SIZE 2
#define R_SYSTEM_PVDCR0_RIE (1 <<  0)                                                    /* 01: Voltage Monitor Interrupt/Reset Enable */
#define R_SYSTEM_PVDCR0_DFDIS (1 <<  1)                                                  /* 02: Voltage Monitor Digital Filter Disable Mode Select */
#define R_SYSTEM_PVDCR0_CMPE (1 <<  2)                                                   /* 04: Voltage Monitor Circuit Comparison Result Output Enable */
#define R_SYSTEM_PVDCR0_FSAMP_SHIFT (4)
#define R_SYSTEM_PVDCR0_FSAMP_MASK (0x3)
#  define R_SYSTEM_PVDCR0_FSAMP_V1_2_LOCO_FREQUENCY (0 << R_SYSTEM_PVDCR0_FSAMP_SHIFT)   /* 1/2 LOCO frequency */
#  define R_SYSTEM_PVDCR0_FSAMP_V1_4_LOCO_FREQUENCY (1 << R_SYSTEM_PVDCR0_FSAMP_SHIFT)   /* 1/4 LOCO frequency */
#  define R_SYSTEM_PVDCR0_FSAMP_V1_8_LOCO_FREQUENCY (2 << R_SYSTEM_PVDCR0_FSAMP_SHIFT)   /* 1/8 LOCO frequency */
#  define R_SYSTEM_PVDCR0_FSAMP_V1_16_LOCO_FREQUENCY (3 << R_SYSTEM_PVDCR0_FSAMP_SHIFT)  /* 1/16 LOCO frequency */
#define R_SYSTEM_PVDCR0_RI (1 <<  6)                                                     /* 40: Voltage Monitor Circuit Mode Select */
#define R_SYSTEM_PVDCR0_RN (1 <<  7)                                                     /* 80: Voltage Monitor Reset Negate Select */

/* Battery Backup Voltage Monitor Function Select Register (8-bits) *********/

#define R_SYSTEM_VBATTMNSELR_VBATTMNSEL (1 <<  0)  /* 01: VBATT Voltage Monitor Function Select Bit */

/* VBATT Battery Power Supply Control Register 1 (8-bits) *******************/

#define R_SYSTEM_VBTBPCR1_BPWSWSTP (1 <<  0)  /* 01: Battery Power Supply Switch Stop */

/* Low Power State Control Register (8-bits) ********************************/

#define R_SYSTEM_LPSCR_LPMD_SHIFT (0)
#define R_SYSTEM_LPSCR_LPMD_MASK (0xf)
#  define R_SYSTEM_LPSCR_LPMD_SYSTEM_ACTIVE (0 << R_SYSTEM_LPSCR_LPMD_SHIFT)            /* System Active */
#  define R_SYSTEM_LPSCR_LPMD_PROHIBITED_RESERVED_1 (1 << R_SYSTEM_LPSCR_LPMD_SHIFT)    /* Prohibited. (reserved) */
#  define R_SYSTEM_LPSCR_LPMD_V2H (2 << R_SYSTEM_LPSCR_LPMD_SHIFT)                      /* Prohibited. (reserved) for CPU0 Deep Sleep */
#  define R_SYSTEM_LPSCR_LPMD_V3H (3 << R_SYSTEM_LPSCR_LPMD_SHIFT)                      /* Prohibited. (reserved) CPU0 Power Gating */
#  define R_SYSTEM_LPSCR_LPMD_SOFTWARE_STANDBY_MODE_1 (4 << R_SYSTEM_LPSCR_LPMD_SHIFT)  /* Software Standby mode 1 */
#  define R_SYSTEM_LPSCR_LPMD_SOFTWARE_STANDBY_MODE_2 (5 << R_SYSTEM_LPSCR_LPMD_SHIFT)  /* Software Standby mode 2 */
#  define R_SYSTEM_LPSCR_LPMD_V6H (6 << R_SYSTEM_LPSCR_LPMD_SHIFT)                      /* Prohibited. (reserved for Software Standby mode 3) */
#  define R_SYSTEM_LPSCR_LPMD_PROHIBITED_RESERVED_7 (7 << R_SYSTEM_LPSCR_LPMD_SHIFT)    /* Prohibited. (reserved) */
#  define R_SYSTEM_LPSCR_LPMD_V8H (8 << R_SYSTEM_LPSCR_LPMD_SHIFT)                      /* Deep Software Standby mode 1 */
#  define R_SYSTEM_LPSCR_LPMD_V9H (9 << R_SYSTEM_LPSCR_LPMD_SHIFT)                      /* Deep Software Standby mode 2 */
#  define R_SYSTEM_LPSCR_LPMD_AH (10 << R_SYSTEM_LPSCR_LPMD_SHIFT)                      /* Deep Software Standby mode 3 */

/* Software Standby Control Register 1 (8-bits) *****************************/

#define R_SYSTEM_SSCR1_SS1FR (1 <<  0)  /* 01: Software Standby 1 Fast Return */

/* Low Power State Control Register (8-bits) ********************************/

#define R_SYSTEM_LVOCR_LVO0E (1 <<  0)  /* 01: Low Voltage Operation 0 Enable */
#define R_SYSTEM_LVOCR_LVO1E (1 <<  1)  /* 02: Low Voltage Operation 1 Enable */

/* System Reset Mask Control Register0 (8-bits) *****************************/

#define R_SYSTEM_SYRSTMSK0_IWDTMASK (1 <<  0)   /* 01: Independent watchdog timer Reset Mask */
#define R_SYSTEM_SYRSTMSK0_WDT0MASK (1 <<  1)   /* 02: CPU0 Watchdog timer Reset Mask */
#define R_SYSTEM_SYRSTMSK0_SWMASK (1 <<  2)     /* 04: Software Reset Mask */
#define R_SYSTEM_SYRSTMSK0_CLUP0MASK (1 <<  4)  /* 10: CPU0 Lockup Reset Mask */
#define R_SYSTEM_SYRSTMSK0_LM0MASK (1 <<  5)    /* 20: Local memory 0 error Reset Mask */
#define R_SYSTEM_SYRSTMSK0_CMMASK (1 <<  6)     /* 40: Common memory error Reset Mask */
#define R_SYSTEM_SYRSTMSK0_BUSMASK (1 <<  7)    /* 80: BUS error Reset Mask */

/* System Reset Mask Control Register1 (8-bits) *****************************/

#define R_SYSTEM_SYRSTMSK1_LM1MASK (1 <<  5)  /* 20: Local memory 1 error Reset Mask */
#define R_SYSTEM_SYRSTMSK1_NWMASK (1 <<  7)   /* 80: Network Reset Mask */

/* System Reset Mask Control Register2 (8-bits) *****************************/

#define R_SYSTEM_SYRSTMSK2_PVD1MASK (1 <<  0)  /* 01: Voltage Monitor 1 Reset Mask */
#define R_SYSTEM_SYRSTMSK2_PVD2MASK (1 <<  1)  /* 02: Voltage Monitor 2 Reset Mask */
#define R_SYSTEM_SYRSTMSK2_PVD3MASK (1 <<  2)  /* 04: Voltage Monitor 3 Reset Mask */
#define R_SYSTEM_SYRSTMSK2_PVD4MASK (1 <<  3)  /* 08: Voltage Monitor 4 Reset Mask */
#define R_SYSTEM_SYRSTMSK2_PVD5MASK (1 <<  4)  /* 10: Voltage Monitor 5 Reset Mask */

/* PLL1-LDO Control Register (8-bits) ***************************************/

#define R_SYSTEM_PLL1LDOCR_LDOSTP (1 <<  0)  /* 01: LDO Stop */
#define R_SYSTEM_PLL1LDOCR_SKEEP (1 <<  1)   /* 02: STBY Keep */

/* PLL2-LDO Control Register (8-bits) ***************************************/

#define R_SYSTEM_PLL2LDOCR_LDOSTP (1 <<  0)  /* 01: LDO Stop */
#define R_SYSTEM_PLL2LDOCR_SKEEP (1 <<  1)   /* 02: STBY Keep */

/* HOCO-LDO Control Register (8-bits) ***************************************/

#define R_SYSTEM_HOCOLDOCR_LDOSTP (1 <<  0)  /* 01: LDO Stop */
#define R_SYSTEM_HOCOLDOCR_SKEEP (1 <<  1)   /* 02: STBY Keep */

/* Main Clock Oscillator Mode Control Register 2 (8-bits) *******************/

#define R_SYSTEM_MOMCR2_MOMODE (1 <<  0)  /* 01: Main Clock Oscillator Mode Select */

/* Sub-clock oscillator control register (8-bits) ***************************/

#define R_SYSTEM_SOSCCR_SOSTP (1 <<  0)  /* 01: Sub-Clock Oscillator Stop */

/* Sub Clock Oscillator Mode Control Register (8-bits) **********************/

#define R_SYSTEM_SOMCR_SODRV_SHIFT (0)
#define R_SYSTEM_SOMCR_SODRV_MASK (0x3)
#  define R_SYSTEM_SOMCR_SODRV_V00 (0 << R_SYSTEM_SOMCR_SODRV_SHIFT)                   /* :Standard(12.5pf) (value after reset) */
#  define R_SYSTEM_SOMCR_SODRV_LOW_POWER_MODE_1_9PF (1 << R_SYSTEM_SOMCR_SODRV_SHIFT)  /* Low power mode 1 (9pf) */
#  define R_SYSTEM_SOMCR_SODRV_LOW_POWER_MODE_2_7PF (2 << R_SYSTEM_SOMCR_SODRV_SHIFT)  /* Low power mode 2 (7pf) */
#  define R_SYSTEM_SOMCR_SODRV_LOW_POWER_MODE_3_4PF (3 << R_SYSTEM_SOMCR_SODRV_SHIFT)  /* Low power mode 3 (4pf) */
#define R_SYSTEM_SOMCR_SOSEL (1 <<  6)                                                 /* 40: Sub Clock Oscillator Switching */

/* VBATT Backup Enable Register (8-bits) ************************************/

