apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_system.h
#define R_SYSTEM_VBTBER_VBAE (1 <<  3)  /* 08: VBATT backup register access enable bit */

/* VBATT Battery Power Supply Control Register 2 (8-bits) *******************/

#define R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT (0)
#define R_SYSTEM_VBTBPCR2_VDETLVL_MASK (0x7)
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V2_8V (0 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)             /* 2.8V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V2_53V (1 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)            /* 2.53V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V2_10V (2 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)            /* 2.10V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V1_95V (3 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)            /* 1.95V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V1_85V (4 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)            /* 1.85V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V1_75V (5 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)            /* 1.75V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_V1_65V (6 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)            /* 1.65V */
#  define R_SYSTEM_VBTBPCR2_VDETLVL_PROHIBITED_1_55V (7 << R_SYSTEM_VBTBPCR2_VDETLVL_SHIFT)  /* prohibited (1.55V) */
#define R_SYSTEM_VBTBPCR2_VDETE (1 <<  4)                                                    /* 10: Voltage drop detection enable */

/* VBATT Battery Power Supply Status Register (8-bits) **********************/

#define R_SYSTEM_VBTBPSR_VBPORF (1 <<  0)  /* 01: VBATT_POR Flag */
#define R_SYSTEM_VBTBPSR_VBPORM (1 <<  4)  /* 10: VBATT_POR Monitor */
#define R_SYSTEM_VBTBPSR_BPWSWM (1 <<  5)  /* 20: Battery Power Supply Switch Status Monitor */

/* VBATT Tamper detection Status Register (8-bits) **************************/

#define R_SYSTEM_VBTADSR_VBTADF0 (1 <<  0)  /* 01: VBATT Tamper Detection flag 0 */
#define R_SYSTEM_VBTADSR_VBTADF1 (1 <<  1)  /* 02: VBATT Tamper Detection flag 1 */
#define R_SYSTEM_VBTADSR_VBTADF2 (1 <<  2)  /* 04: VBATT Tamper Detection flag 2 */

/* VBATT Tamper detection Control Register 1 (8-bits) ***********************/

#define R_SYSTEM_VBTADCR1_VBTADIE0 (1 <<  0)   /* 01: VBATT Tamper Detection Interrupt Enable 0 */
#define R_SYSTEM_VBTADCR1_VBTADIE1 (1 <<  1)   /* 02: VBATT Tamper Detection Interrupt Enable 1 */
#define R_SYSTEM_VBTADCR1_VBTADIE2 (1 <<  2)   /* 04: VBATT Tamper Detection Interrupt Enable 2 */
#define R_SYSTEM_VBTADCR1_VBTADCLE0 (1 <<  4)  /* 10: VBATT Tamper Detection Backup Register Clear Enable 0 */
#define R_SYSTEM_VBTADCR1_VBTADCLE1 (1 <<  5)  /* 20: VBATT Tamper Detection Backup Register Clear Enable 1 */
#define R_SYSTEM_VBTADCR1_VBTADCLE2 (1 <<  6)  /* 40: VBATT Tamper Detection Backup Register Clear Enable 2 */

/* VBATT Tamper detection Control Register 2 (8-bits) ***********************/

#define R_SYSTEM_VBTADCR2_VBRTCES0 (1 <<  0)  /* 01: VBATT RTC Time Capture Event Source Select 0 */
#define R_SYSTEM_VBTADCR2_VBRTCES1 (1 <<  1)  /* 02: VBATT RTC Time Capture Event Source Select 1 */
#define R_SYSTEM_VBTADCR2_VBRTCES2 (1 <<  2)  /* 04: VBATT RTC Time Capture Event Source Select 2 */

/* VBATT Input Control Register (8-bits) ************************************/

#define R_SYSTEM_VBTICTLR_VCH0INEN (1 <<  0)  /* 01: RTCIC0 Input Enable */
#define R_SYSTEM_VBTICTLR_VCH1INEN (1 <<  1)  /* 02: RTCIC1 Input Enable */
#define R_SYSTEM_VBTICTLR_VCH2INEN (1 <<  2)  /* 04: RTCIC2 Input Enable */

/* VBATT Input Control Register 2 (8-bits) **********************************/

#define R_SYSTEM_VBTICTLR2_VCH0NCE (1 <<  0)  /* 01: VBATT CH0 Input Noise Canceler Enable */
#define R_SYSTEM_VBTICTLR2_VCH1NCE (1 <<  1)  /* 02: VBATT CH1 Input Noise Canceler Enable */
#define R_SYSTEM_VBTICTLR2_VCH2NCE (1 <<  2)  /* 04: VBATT CH2 Input Noise Canceler Enable */
#define R_SYSTEM_VBTICTLR2_VCH0EG (1 <<  4)   /* 10: VBATT CH0 Input Edge Select */
#define R_SYSTEM_VBTICTLR2_VCH1EG (1 <<  5)   /* 20: VBATT CH1 Input Edge Select */
#define R_SYSTEM_VBTICTLR2_VCH2EG (1 <<  6)   /* 40: VBATT CH2 Input Edge Select */

/* VBATT Input Monitor Register (8-bits) ************************************/

#define R_SYSTEM_VBTIMONR_VCH0MON (1 <<  0)  /* 01: VBATT CH0 Input monitor */
#define R_SYSTEM_VBTIMONR_VCH1MON (1 <<  1)  /* 02: VBATT CH1 Input monitor */
#define R_SYSTEM_VBTIMONR_VCH2MON (1 <<  2)  /* 04: VBATT CH2 Input monitor */

/* VBATT Backup Register %s (8-bits) ****************************************/

#define R_SYSTEM_VBTBKR_SIZE 128
#define R_SYSTEM_VBTBKR_VBTBKR_SHIFT (0)
#define R_SYSTEM_VBTBKR_VBTBKR_MASK (0xff)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_RA8M1_HARDWARE_RA8M1_SYSTEM_H */
